function LongTao(Search, Write)
  gg.clearResults()
  gg.setVisible(false)
  lx=Search[1]["类型"]
  gg.searchNumber(Search[1]["主特征码"], lx)
  local count = gg.getResultCount()
  local result = gg.getResults(count)
  gg.clearResults()
  local data = {}
  if (count > 0) then
    gg.toast("共搜索 "..count.." 条数据")
    for i, v in ipairs(result) do
      v.isUseful = true
    end
    for k=2, #Search do
      local tmp = {}
      local num = Search[k]["副特征码"]
      if Search[k]["类型"]~= nil then
           lx =Search[k]["类型"]
         else
           lx = Search[1]["类型"]
        end
      for i, v in ipairs(result) do
        tmp[#tmp+1] = {}
        tmp[#tmp].address = v.address + Search[k]["偏移"]
        tmp[#tmp].flags = lx
      end
      tmp = gg.getValues(tmp)
      for i, v in ipairs(tmp) do
        if ( tostring(v.value) ~= tostring(num) ) then
          result[i].isUseful = false
        end
      end
    end
    for i, v in ipairs(result) do
      if (v.isUseful) then
        data[#data+1] = v.address
      end
    end
    if (#data > 0) then
      local t = {}
      for i=1, #data do
        for k, w in ipairs(Write) do
          if w["类型"] ~= nil then
             lx = w["类型"]
           else
             lx = Search[1]["类型"]
          end
          t[#t+1] = {}
          t[#t].address = data[i] + w["偏移"]
          t[#t].flags = lx
          if (w["修改"]~=nil) and (w["修改"]~=false) then
            t[#t].value = w["修改"]
            gg.setValues(t)
            if (w["冻结"] == true) then
              local item = {}
              item[#item+1] = t[#t]
              item[#item].freeze = w["冻结"]
              gg.addListItems(item)
            end
          end
        end
      end
      gg.loadResults(t)
      gg.toast("共偏移 "..#t.." 条数据")
     else
      gg.toast("未搜到数据！")
      return false
    end
   else
    gg.toast("未搜到数据！")
    return false
  end
end


function Main0()
SN = gg.choice({
	 "道具卡等级属性",
	 "道具卡冷却时间",
	 "道具卡属性加强",
	 "满级人物天赋",
	 "上分必备功能",
	 "大乱斗专属",
	 "防封设置",
	 "设备解封",
	 "退出脚本",
}, nil, os.date"当前时间:%Y年-%m月-%d日 %H时 %M分 ")
if SN==1 then
	 Main1()
end
if SN==2 then
	 Main134()
end
if SN==3 then
	 Main140()
end
if SN==4 then
	 Main26()
end
if SN==5 then
	 Main79()
end
if SN==6 then
	 Main87()
end
if SN==7 then
	 Main113()
end
if SN==8 then
	 Main126()
end
if SN==9 then
	 HS85()
end
FX1=0
end

function Main1()
SN = gg.multiChoice({
	 "疾跑时间上调",
	 "跳高时间上调",
	 "手榴弹价格下调",
	 "皮卡速度上调",
	 "侦查眼时间上调",
	 "生命护盾值上调",
	 "雷达金币下调",
	 "医疗包金币下调",
	 "火箭筒间隔下调",
	 "阻挡箱金币下调",
	 "巡逻犬血量上调",
	 "肾上腺素时间上调",
	 "迫击炮间隔下调",
	 "酒桶价格下调",
	 "飞爪价格下调",
	 "传送门价格下调",
	 "自走球速度上调",
	 "毒液价格下调",
	 "冲锋枪间隔下调",
	 "滑板速度上调",
	 "魔法墙价格下调",
	 "引力场价格下调",
	 "治疗球血量上调",
	 "充气垫金币下调",
	 "返回功能主页",
}, nil, "大厅开启\n温馨提示:需要什么就开启什么，没必要一次性开启太多，因为这样会浪费没必要的时间。")
if SN[1]==true then
	 HS2()
end
if SN[2]==true then
	 HS3()
end
if SN[3]==true then
	 HS4()
end
if SN[4]==true then
	 HS5()
end
if SN[5]==true then
	 HS6()
end
if SN[6]==true then
	 HS7()
end
if SN[7]==true then
	 HS8()
end
if SN[8]==true then
	 HS9()
end
if SN[9]==true then
	 HS10()
end
if SN[10]==true then
	 HS11()
end
if SN[11]==true then
	 HS12()
end
if SN[12]==true then
	 HS13()
end
if SN[13]==true then
	 HS14()
end
if SN[14]==true then
	 HS15()
end
if SN[15]==true then
	 HS16()
end
if SN[16]==true then
	 HS17()
end
if SN[17]==true then
	 HS18()
end
if SN[18]==true then
	 HS19()
end
if SN[19]==true then
	 HS20()
end
if SN[20]==true then
	 HS21()
end
if SN[21]==true then
	 HS22()
end
if SN[22]==true then
	 HS23()
end
if SN[23]==true then
	 HS24()
end
if SN[24]==true then
	 HS108()
end
if SN[25]==true then
	 HS25()
end
FX1=0
end

function HS2()
  gg.setRanges(gg.REGION_ANONYMOUS)
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  4.300000190734863  } , 
{["类型"]=  4  ,["偏移"]=  -16  ,["副特征码"]=  1000  },
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  0.30000001192092896  },
{["类型"]=  4  ,["偏移"]=  8  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  8  } , 
} LongTao(tb1, tb2)
  gg.setRanges(gg.REGION_ANONYMOUS)
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  0.30000001192092896  } , 
{["类型"]=  4  ,["偏移"]=  -20  ,["副特征码"]=  1000  },
{["类型"]=  16  ,["偏移"]=  -4  ,["副特征码"]=  8.0  },
{["类型"]=  4  ,["偏移"]=  4  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  0.0  } , 
} LongTao(tb1, tb2)
end

function HS3()
  gg.setRanges(gg.REGION_ANONYMOUS)
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  4.300000190734863  } , 
{["类型"]=  4  ,["偏移"]=  -16  ,["副特征码"]=  1001  },
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  0.30000001192092896  },
{["类型"]=  4  ,["偏移"]=  8  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  8  } , 
} LongTao(tb1, tb2)
  gg.setRanges(gg.REGION_ANONYMOUS)
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  0.30000001192092896  } , 
{["类型"]=  4  ,["偏移"]=  -20  ,["副特征码"]=  1001  },
{["类型"]=  16  ,["偏移"]=  -4  ,["副特征码"]=  8.0  },
{["类型"]=  4  ,["偏移"]=  4  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  0.0  } , 
} LongTao(tb1, tb2)
end

function HS4()
  gg.setRanges(gg.REGION_ANONYMOUS)
local tb1={ 
{["类型"] =  4  ,["主特征码"] =  1002  } , 
{["类型"]=  16  ,["偏移"]=  16  ,["副特征码"]=  1.0  },
{["类型"]=  16  ,["偏移"]=  20  ,["副特征码"]=  -0.016599999740719795  },
{["类型"]=  4  ,["偏移"]=  24  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  16  , ["冻结"] =  false  , ["修改"] =  0.5  } , 
} LongTao(tb1, tb2)
  gg.setRanges(gg.REGION_ANONYMOUS)
local tb1={ 
{["类型"] =  4  ,["主特征码"] =  1002  } , 
{["类型"]=  16  ,["偏移"]=  16  ,["副特征码"]=  0.5  },
{["类型"]=  16  ,["偏移"]=  20  ,["副特征码"]=  -0.016599999740719795  },
{["类型"]=  4  ,["偏移"]=  24  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  20  , ["冻结"] =  false  , ["修改"] =  0.0  } , 
} LongTao(tb1, tb2)
end

function HS5()
  gg.setRanges(gg.REGION_ANONYMOUS)
local tb1={ 
{["类型"] =  4  ,["主特征码"] =  1003  } , 
{["类型"]=  16  ,["偏移"]=  16  ,["副特征码"]=  1.0  },
{["类型"]=  16  ,["偏移"]=  20  ,["副特征码"]=  0.009999999776482582  },
{["类型"]=  4  ,["偏移"]=  24  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  20  , ["冻结"] =  false  , ["修改"] =  0.0  } , 
} LongTao(tb1, tb2)
local tb1={ 
{["类型"] =  4  ,["主特征码"] =  1003  } , 
{["类型"]=  16  ,["偏移"]=  16  ,["副特征码"]=  1.0  },
{["类型"]=  16  ,["偏移"]=  20  ,["副特征码"]=  0.0  },
{["类型"]=  4  ,["偏移"]=  24  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  16  , ["冻结"] =  false  , ["修改"] =  1.13  } , 
} LongTao(tb1, tb2)
end

function HS6()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  30.0  } , 
{["类型"]=  4  ,["偏移"]=  -16  ,["副特征码"]=  1004  },
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  3.0  },
{["类型"]=  4  ,["偏移"]=  8  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  70.0  } , 
} LongTao(tb1, tb2)
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  3.0  } , 
{["类型"]=  4  ,["偏移"]=  -20  ,["副特征码"]=  1004  },
{["类型"]=  16  ,["偏移"]=  -4  ,["副特征码"]=  70.0  },
{["类型"]=  4  ,["偏移"]=  4  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  0.0  } , 
} LongTao(tb1, tb2)
end

function HS7()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  112.0  } , 
{["类型"]=  4  ,["偏移"]=  -16  ,["副特征码"]=  1005  },
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  4.0  },
{["类型"]=  4  ,["偏移"]=  8  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  180  } , 
} LongTao(tb1, tb2)
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  4.0  } , 
{["类型"]=  4  ,["偏移"]=  -20  ,["副特征码"]=  1005  },
{["类型"]=  16  ,["偏移"]=  -4  ,["副特征码"]=  180.0  },
{["类型"]=  4  ,["偏移"]=  4  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  0.0  } , 
} LongTao(tb1, tb2)
end

function HS8()
local tb1={ 
{["类型"] =  4  ,["主特征码"] =  1006  } , 
{["类型"]=  16  ,["偏移"]=  16  ,["副特征码"]=  1.0  },
{["类型"]=  16  ,["偏移"]=  20  ,["副特征码"]=  -0.020800000056624413  },
{["类型"]=  4  ,["偏移"]=  24  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  16  , ["冻结"] =  false  , ["修改"] =  0.5  } , 
} LongTao(tb1, tb2)
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  -0.020800000056624413  } , 
{["类型"]=  4  ,["偏移"]=  -20  ,["副特征码"]=  1006  },
{["类型"]=  16  ,["偏移"]=  -4  ,["副特征码"]=  0.5  },
{["类型"]=  4  ,["偏移"]=  4  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  0.0  } , 
} LongTao(tb1, tb2)
end

function HS9()
local tb1={ 
{["类型"] =  4  ,["主特征码"] =  1007  } , 
{["类型"]=  16  ,["偏移"]=  16  ,["副特征码"]=  1.0  },
{["类型"]=  16  ,["偏移"]=  20  ,["副特征码"]=  -0.020800000056624413  },
{["类型"]=  4  ,["偏移"]=  24  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  16  , ["冻结"] =  false  , ["修改"] =  0.5  } , 
} LongTao(tb1, tb2)
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  -0.020800000056624413  } , 
{["类型"]=  4  ,["偏移"]=  -20  ,["副特征码"]=  1007  },
{["类型"]=  16  ,["偏移"]=  -4  ,["副特征码"]=  0.5  },
{["类型"]=  4  ,["偏移"]=  4  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  0.0  } , 
} LongTao(tb1, tb2)
end

function HS10()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  1.100000023841858  } , 
{["类型"]=  4  ,["偏移"]=  -16  ,["副特征码"]=  1008  },
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  -0.05999999865889549  },
{["类型"]=  4  ,["偏移"]=  8  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  0.3  } , 
} LongTao(tb1, tb2)
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  -0.05999999865889549  } , 
{["类型"]=  4  ,["偏移"]=  -20  ,["副特征码"]=  1008  },
{["类型"]=  16  ,["偏移"]=  -4  ,["副特征码"]=  0.30000001192092896  },
{["类型"]=  4  ,["偏移"]=  4  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  0.0  } , 
} LongTao(tb1, tb2)
end

function HS11()
local tb1={ 
{["类型"] =  4  ,["主特征码"] =  1009  } , 
{["类型"]=  16  ,["偏移"]=  16  ,["副特征码"]=  1.0  },
{["类型"]=  16  ,["偏移"]=  20  ,["副特征码"]=  -0.03999999910593033  },
{["类型"]=  4  ,["偏移"]=  24  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  16  , ["冻结"] =  false  , ["修改"] =  0.4  } , 
} LongTao(tb1, tb2)
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  -0.03999999910593033  } , 
{["类型"]=  4  ,["偏移"]=  -20  ,["副特征码"]=  1009  },
{["类型"]=  16  ,["偏移"]=  -4  ,["副特征码"]=  0.4000000059604645  },
{["类型"]=  4  ,["偏移"]=  4  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  0.0  } , 
} LongTao(tb1, tb2)
end

function HS12()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  100.0  } , 
{["类型"]=  4  ,["偏移"]=  -16  ,["副特征码"]=  1010  },
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  6.0  },
{["类型"]=  4  ,["偏移"]=  8  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  180  } , 
} LongTao(tb1, tb2)
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  6.0  } , 
{["类型"]=  4  ,["偏移"]=  -20  ,["副特征码"]=  1010  },
{["类型"]=  16  ,["偏移"]=  -4  ,["副特征码"]=  180.0  },
{["类型"]=  4  ,["偏移"]=  4  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  0.0  } , 
} LongTao(tb1, tb2)
end

function HS13()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  5.0  } , 
{["类型"]=  4  ,["偏移"]=  -16  ,["副特征码"]=  1011  },
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  0.4000000059604645  },
{["类型"]=  4  ,["偏移"]=  8  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  10  } , 
} LongTao(tb1, tb2)
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  0.4000000059604645  } , 
{["类型"]=  4  ,["偏移"]=  -20  ,["副特征码"]=  1011  },
{["类型"]=  16  ,["偏移"]=  -4  ,["副特征码"]=  10.0  },
{["类型"]=  4  ,["偏移"]=  4  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  0.0  } , 
} LongTao(tb1, tb2)
end

function HS14()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  1.100000023841858  } , 
{["类型"]=  4  ,["偏移"]=  -16  ,["副特征码"]=  1012  },
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  -0.03999999910593033  },
{["类型"]=  4  ,["偏移"]=  8  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  0.6  } , 
} LongTao(tb1, tb2)
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  -0.03999999910593033  } , 
{["类型"]=  4  ,["偏移"]=  -20  ,["副特征码"]=  1012  },
{["类型"]=  16  ,["偏移"]=  -4  ,["副特征码"]=  0.6000000238418579  },
{["类型"]=  4  ,["偏移"]=  4  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  0.0  } , 
} LongTao(tb1, tb2)
end

function HS15()
local tb1={ 
{["类型"] =  4  ,["主特征码"] =  1013  } , 
{["类型"]=  16  ,["偏移"]=  16  ,["副特征码"]=  1.0  },
{["类型"]=  16  ,["偏移"]=  20  ,["副特征码"]=  -0.016599999740719795  },
{["类型"]=  4  ,["偏移"]=  24  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  20  , ["冻结"] =  false  , ["修改"] =  0.0  } , 
} LongTao(tb1, tb2)
local tb1={ 
{["类型"] =  4  ,["主特征码"] =  1013  } , 
{["类型"]=  16  ,["偏移"]=  16  ,["副特征码"]=  1.0  },
{["类型"]=  16  ,["偏移"]=  20  ,["副特征码"]=  0.0  },
{["类型"]=  4  ,["偏移"]=  24  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  16  , ["冻结"] =  false  , ["修改"] =  0.5  } , 
} LongTao(tb1, tb2)
end

function HS16()
local tb1={ 
{["类型"] =  4  ,["主特征码"] =  1014  } , 
{["类型"]=  16  ,["偏移"]=  16  ,["副特征码"]=  1.0  },
{["类型"]=  16  ,["偏移"]=  20  ,["副特征码"]=  -0.029999999329447746  },
{["类型"]=  4  ,["偏移"]=  24  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  20  , ["冻结"] =  false  , ["修改"] =  0.0  } , 
} LongTao(tb1, tb2)
local tb1={ 
{["类型"] =  4  ,["主特征码"] =  1014  } , 
{["类型"]=  16  ,["偏移"]=  16  ,["副特征码"]=  1.0  },
{["类型"]=  16  ,["偏移"]=  20  ,["副特征码"]=  0.0  },
{["类型"]=  4  ,["偏移"]=  24  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  16  , ["冻结"] =  false  , ["修改"] =  0.4  } , 
} LongTao(tb1, tb2)
end

function HS17()
local tb1={ 
{["类型"] =  4  ,["主特征码"] =  1015  } , 
{["类型"]=  16  ,["偏移"]=  16  ,["副特征码"]=  1.0  },
{["类型"]=  16  ,["偏移"]=  20  ,["副特征码"]=  -0.027799999341368675  },
{["类型"]=  4  ,["偏移"]=  24  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  20  , ["冻结"] =  false  , ["修改"] =  0.0  } , 
} LongTao(tb1, tb2)
local tb1={ 
{["类型"] =  4  ,["主特征码"] =  1015  } , 
{["类型"]=  16  ,["偏移"]=  16  ,["副特征码"]=  1.0  },
{["类型"]=  16  ,["偏移"]=  20  ,["副特征码"]=  0.0  },
{["类型"]=  4  ,["偏移"]=  24  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  16  , ["冻结"] =  false  , ["修改"] =  0.5  } , 
} LongTao(tb1, tb2)
end

function HS18()
local tb1={ 
{["类型"] =  4  ,["主特征码"] =  1016  } , 
{["类型"]=  16  ,["偏移"]=  16  ,["副特征码"]=  1.0  },
{["类型"]=  16  ,["偏移"]=  20  ,["副特征码"]=  0.009999999776482582  },
{["类型"]=  4  ,["偏移"]=  24  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  20  , ["冻结"] =  false  , ["修改"] =  0.0  } , 
} LongTao(tb1, tb2)
local tb1={ 
{["类型"] =  4  ,["主特征码"] =  1016  } , 
{["类型"]=  16  ,["偏移"]=  16  ,["副特征码"]=  1.0  },
{["类型"]=  16  ,["偏移"]=  20  ,["副特征码"]=  0.0  },
{["类型"]=  4  ,["偏移"]=  24  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  16  , ["冻结"] =  false  , ["修改"] =  1.13  } , 
} LongTao(tb1, tb2)
end

function HS19()
local tb1={ 
{["类型"] =  4  ,["主特征码"] =  1017  } , 
{["类型"]=  16  ,["偏移"]=  16  ,["副特征码"]=  1.0  },
{["类型"]=  16  ,["偏移"]=  20  ,["副特征码"]=  -0.027799999341368675  },
{["类型"]=  4  ,["偏移"]=  24  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  20  , ["冻结"] =  false  , ["修改"] =  0.0  } , 
} LongTao(tb1, tb2)
local tb1={ 
{["类型"] =  4  ,["主特征码"] =  1017  } , 
{["类型"]=  16  ,["偏移"]=  16  ,["副特征码"]=  1.0  },
{["类型"]=  16  ,["偏移"]=  20  ,["副特征码"]=  0.0  },
{["类型"]=  4  ,["偏移"]=  24  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  16  , ["冻结"] =  false  , ["修改"] =  0.5  } , 
} LongTao(tb1, tb2)
end

function HS20()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  1.100000023841858  } , 
{["类型"]=  4  ,["偏移"]=  -16  ,["副特征码"]=  1018  },
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  -0.05000000074505806  },
{["类型"]=  4  ,["偏移"]=  8  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  0.45  } , 
} LongTao(tb1, tb2)
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  -0.05000000074505806  } , 
{["类型"]=  4  ,["偏移"]=  -20  ,["副特征码"]=  1018  },
{["类型"]=  16  ,["偏移"]=  -4  ,["副特征码"]=  0.44999998807907104  },
{["类型"]=  4  ,["偏移"]=  4  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  0.0  } , 
} LongTao(tb1, tb2)
end

function HS21()
local tb1={ 
{["类型"] =  4  ,["主特征码"] =  1019  } , 
{["类型"]=  16  ,["偏移"]=  16  ,["副特征码"]=  1.0  },
{["类型"]=  16  ,["偏移"]=  20  ,["副特征码"]=  0.009999999776482582  },
{["类型"]=  4  ,["偏移"]=  24  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  20  , ["冻结"] =  false  , ["修改"] =  0.0  } , 
} LongTao(tb1, tb2)
local tb1={ 
{["类型"] =  4  ,["主特征码"] =  1019  } , 
{["类型"]=  16  ,["偏移"]=  16  ,["副特征码"]=  1.0  },
{["类型"]=  16  ,["偏移"]=  20  ,["副特征码"]=  0.0  },
{["类型"]=  4  ,["偏移"]=  24  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  16  , ["冻结"] =  false  , ["修改"] =  1.13  } , 
} LongTao(tb1, tb2)
end

function HS22()
local tb1={ 
{["类型"] =  4  ,["主特征码"] =  1020  } , 
{["类型"]=  16  ,["偏移"]=  16  ,["副特征码"]=  1.0  },
{["类型"]=  16  ,["偏移"]=  20  ,["副特征码"]=  -0.029999999329447746  },
{["类型"]=  4  ,["偏移"]=  24  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  20  , ["冻结"] =  false  , ["修改"] =  0.0  } , 
} LongTao(tb1, tb2)
local tb1={ 
{["类型"] =  4  ,["主特征码"] =  1020  } , 
{["类型"]=  16  ,["偏移"]=  16  ,["副特征码"]=  1.0  },
{["类型"]=  16  ,["偏移"]=  20  ,["副特征码"]=  0.0  },
{["类型"]=  4  ,["偏移"]=  24  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  16  , ["冻结"] =  false  , ["修改"] =  0.4  } , 
} LongTao(tb1, tb2)
end

function HS23()
local tb1={ 
{["类型"] =  4  ,["主特征码"] =  1021  } , 
{["类型"]=  16  ,["偏移"]=  16  ,["副特征码"]=  1.0  },
{["类型"]=  16  ,["偏移"]=  20  ,["副特征码"]=  -0.02160000056028366  },
{["类型"]=  4  ,["偏移"]=  24  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  20  , ["冻结"] =  false  , ["修改"] =  0.0  } , 
} LongTao(tb1, tb2)
local tb1={ 
{["类型"] =  4  ,["主特征码"] =  1021  } , 
{["类型"]=  16  ,["偏移"]=  16  ,["副特征码"]=  1.0  },
{["类型"]=  16  ,["偏移"]=  20  ,["副特征码"]=  0.0  },
{["类型"]=  4  ,["偏移"]=  24  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  16  , ["冻结"] =  false  , ["修改"] =  0.5  } , 
} LongTao(tb1, tb2)
end

function HS24()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  168.0  } , 
{["类型"]=  4  ,["偏移"]=  -16  ,["副特征码"]=  1022  },
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  6.0  },
{["类型"]=  4  ,["偏移"]=  8  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  250  } , 
} LongTao(tb1, tb2)
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  6.0  } , 
{["类型"]=  4  ,["偏移"]=  -20  ,["副特征码"]=  1022  },
{["类型"]=  16  ,["偏移"]=  -4  ,["副特征码"]=  250.0  },
{["类型"]=  4  ,["偏移"]=  4  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  0.0  } , 
} LongTao(tb1, tb2)
end

function HS108()
local tb1={ 
{["类型"] =  4  ,["主特征码"] =  1023  } , 
{["类型"]=  16  ,["偏移"]=  16  ,["副特征码"]=  1.0  },
{["类型"]=  16  ,["偏移"]=  20  ,["副特征码"]=  -0.027799999341368675  },
{["类型"]=  4  ,["偏移"]=  24  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  20  , ["冻结"] =  false  , ["修改"] =  0.0  } , 
} LongTao(tb1, tb2)
local tb1={ 
{["类型"] =  4  ,["主特征码"] =  1023  } , 
{["类型"]=  16  ,["偏移"]=  16  ,["副特征码"]=  1.0  },
{["类型"]=  16  ,["偏移"]=  20  ,["副特征码"]=  0.0  },
{["类型"]=  4  ,["偏移"]=  24  ,["副特征码"]=  13  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  16  , ["冻结"] =  false  , ["修改"] =  0.5  } , 
} LongTao(tb1, tb2)
end

function HS25()
	 Main0()
end

function Main134()
SN = gg.multiChoice({
	 "3秒道具冷却改1秒冷却",
	 "生命护盾8秒冷却改4秒",
	 "侦查眼10秒冷却改5秒",
	 "雷达30秒冷却改15秒",
	 "返回功能主页",
}, nil, "属性已经给你调好了，怎么用看你自己，稳不稳定也看你自己！")
if SN[1]==true then
	 HS135()
end
if SN[2]==true then
	 HS136()
end
if SN[3]==true then
	 HS139()
end
if SN[4]==true then
	 HS137()
end
if SN[5]==true then
	 HS138()
end
FX1=0
end

function HS135()
	 gg.clearResults()
	 gg.setRanges(32)
	 gg.searchNumber("1000~1023D;3", gg.TYPE_FLOAT, false, gg.SIGN_EQUAL, 0, -1)
	 gg.searchNumber("3", gg.TYPE_FLOAT, false, gg.SIGN_EQUAL, 0, -1)
	 gg.getResults(100)
	 gg.editAll("1", gg.TYPE_FLOAT)
	 gg.toast("提示:修改成功")
	 gg.clearResults()
end

function HS136()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  8.0  } , 
{["类型"]=  4  ,["偏移"]=  8  ,["副特征码"]=  1005  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  4  } , 
} LongTao(tb1, tb2)
end

function HS139()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  10.0  } , 
{["类型"]=  4  ,["偏移"]=  8  ,["副特征码"]=  1004  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  5  } , 
} LongTao(tb1, tb2)
end

function HS137()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  30.0  } , 
{["类型"]=  4  ,["偏移"]=  8  ,["副特征码"]=  1006  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  15  } , 
} LongTao(tb1, tb2)
end

function HS138()
	 Main0()
end

function Main140()
SN = gg.multiChoice({
	 "疾跑微加速",
	 "火箭筒后坐力下调",
	 "冲锋枪6连发改7连发",
	 "冲锋枪7连发改8连发",
	 "冲锋枪8连发改7连发",
	 "冲锋枪7连发改6连发",
	 "返回功能主页",
}, nil, "打个比方，我就是个做枪的，我把枪制作给你，你怎么用与我无关，所以封号了，别找我！")
if SN[1]==true then
	 HS141()
end
if SN[2]==true then
	 HS142()
end
if SN[3]==true then
	 HS143()
end
if SN[4]==true then
	 HS144()
end
if SN[5]==true then
	 HS145()
end
if SN[6]==true then
	 HS146()
end
if SN[7]==true then
	 HS147()
end
FX1=0
end

function HS141()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  0.30000001192092896  } , 
{["类型"]=  16  ,["偏移"]=  -4  ,["副特征码"]=  6.0  },
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  0.0  },
{["类型"]=  16  ,["偏移"]=  8  ,["副特征码"]=  0.0  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  0.4  } , 
} LongTao(tb1, tb2)
end

function HS142()
local tb1={ 
{["类型"] =  4  ,["主特征码"] =  100  } , 
{["类型"]=  16  ,["偏移"]=  -296  ,["副特征码"]=  1.0  },
{["类型"]=  16  ,["偏移"]=  -292  ,["副特征码"]=  1.0  },
{["类型"]=  16  ,["偏移"]=  -184  ,["副特征码"]=  1.0  },
{["类型"]=  16  ,["偏移"]=  -180  ,["副特征码"]=  1.0  },
{["类型"]=  16  ,["偏移"]=  40  ,["副特征码"]=  1.0  },
{["类型"]=  16  ,["偏移"]=  44  ,["副特征码"]=  1.0  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  -296  , ["冻结"] =  false  , ["修改"] =  0.65  } , 
 {["类型"] =  16 ,["偏移"] =  -184  , ["冻结"] =  false  , ["修改"] =  0.65  } , 
 {["类型"] =  16 ,["偏移"] =  40  , ["冻结"] =  false  , ["修改"] =  0.65  } , 
} LongTao(tb1, tb2)
end

function HS143()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  1.100000023841858  } , 
{["类型"]=  4  ,["偏移"]=  -4  ,["副特征码"]=  6  },
{["类型"]=  4  ,["偏移"]=  108  ,["副特征码"]=  6  },
{["类型"]=  16  ,["偏移"]=  112  ,["副特征码"]=  1.100000023841858  },
{["类型"]=  4  ,["偏移"]=  220  ,["副特征码"]=  6  },
{["类型"]=  16  ,["偏移"]=  224  ,["副特征码"]=  1.100000023841858  },
}
 local tb2={ 
 {["类型"] =  4 ,["偏移"] =  -4  , ["冻结"] =  false  , ["修改"] =  7  } , 
 {["类型"] =  4 ,["偏移"] =  108  , ["冻结"] =  false  , ["修改"] =  7  } , 
 {["类型"] =  4 ,["偏移"] =  220  , ["冻结"] =  false  , ["修改"] =  7  } , 
} LongTao(tb1, tb2)
end

function HS144()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  1.100000023841858  } , 
{["类型"]=  4  ,["偏移"]=  -4  ,["副特征码"]=  7  },
{["类型"]=  4  ,["偏移"]=  108  ,["副特征码"]=  7  },
{["类型"]=  16  ,["偏移"]=  112  ,["副特征码"]=  1.100000023841858  },
{["类型"]=  4  ,["偏移"]=  220  ,["副特征码"]=  7  },
{["类型"]=  16  ,["偏移"]=  224  ,["副特征码"]=  1.100000023841858  },
}
 local tb2={ 
 {["类型"] =  4 ,["偏移"] =  -4  , ["冻结"] =  false  , ["修改"] =  8  } , 
 {["类型"] =  4 ,["偏移"] =  108  , ["冻结"] =  false  , ["修改"] =  8  } , 
 {["类型"] =  4 ,["偏移"] =  220  , ["冻结"] =  false  , ["修改"] =  8  } , 
} LongTao(tb1, tb2)
end

function HS145()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  1.100000023841858  } , 
{["类型"]=  4  ,["偏移"]=  -4  ,["副特征码"]=  8  },
{["类型"]=  4  ,["偏移"]=  108  ,["副特征码"]=  8  },
{["类型"]=  16  ,["偏移"]=  112  ,["副特征码"]=  1.100000023841858  },
{["类型"]=  4  ,["偏移"]=  220  ,["副特征码"]=  8  },
{["类型"]=  16  ,["偏移"]=  224  ,["副特征码"]=  1.100000023841858  },
}
 local tb2={ 
 {["类型"] =  4 ,["偏移"] =  -4  , ["冻结"] =  false  , ["修改"] =  7  } , 
 {["类型"] =  4 ,["偏移"] =  108  , ["冻结"] =  false  , ["修改"] =  7  } , 
 {["类型"] =  4 ,["偏移"] =  220  , ["冻结"] =  false  , ["修改"] =  7  } , 
} LongTao(tb1, tb2)
end

function HS146()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  1.100000023841858  } , 
{["类型"]=  4  ,["偏移"]=  -4  ,["副特征码"]=  7  },
{["类型"]=  4  ,["偏移"]=  108  ,["副特征码"]=  7  },
{["类型"]=  16  ,["偏移"]=  112  ,["副特征码"]=  1.100000023841858  },
{["类型"]=  4  ,["偏移"]=  220  ,["副特征码"]=  7  },
{["类型"]=  16  ,["偏移"]=  224  ,["副特征码"]=  1.100000023841858  },
}
 local tb2={ 
 {["类型"] =  4 ,["偏移"] =  -4  , ["冻结"] =  false  , ["修改"] =  6  } , 
 {["类型"] =  4 ,["偏移"] =  108  , ["冻结"] =  false  , ["修改"] =  6  } , 
 {["类型"] =  4 ,["偏移"] =  220  , ["冻结"] =  false  , ["修改"] =  6  } , 
} LongTao(tb1, tb2)
end

function HS147()
	 Main0()
end

function Main26()
SN = gg.choice({
	 "失忆者",
	 "小学妹",
	 "魔术师",
	 "战斗少女",
	 "小狐狸",
	 "雇佣兵",
	 "女特工",
	 "机器人",
	 "发明家",
	 "返回功能主页",
}, nil, "使用愉快！")
if SN==1 then
	 Main30()
end
if SN==2 then
	 Main36()
end
if SN==3 then
	 Main42()
end
if SN==4 then
	 Main48()
end
if SN==5 then
	 Main53()
end
if SN==6 then
	 Main58()
end
if SN==7 then
	 Main63()
end
if SN==8 then
	 Main68()
end
if SN==9 then
	 Main73()
end
if SN==10 then
	 HS78()
end
FX1=0
end

function Main30()
SN = gg.multiChoice({
	 "机关大师概率上调",
	 "机关大师金币上调（50）",
	 "购物达人概率上调",
	 "来抓我呀金币上调（50）",
	 "来抓我呀概率上调",
	 "返回功能主页",
}, nil, "")
if SN[1]==true then
	 HS31()
end
if SN[2]==true then
	 HS116()
end
if SN[3]==true then
	 HS33()
end
if SN[4]==true then
	 HS117()
end
if SN[5]==true then
	 HS34()
end
if SN[6]==true then
	 HS39()
end
FX1=0
end

function HS31()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  0.15000000596046448  } , 
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  0.20000000298023224  },
{["类型"]=  16  ,["偏移"]=  8  ,["副特征码"]=  0.30000001192092896  },
{["类型"]=  16  ,["偏移"]=  12  ,["副特征码"]=  0.5  },
}
 local tb2={ 
{["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  0.5  } , 
{["类型"] =  16 ,["偏移"] =  4  , ["冻结"] =  false  , ["修改"] =  0.5  } , 
{["类型"] =  16 ,["偏移"] =  8  , ["冻结"] =  false  , ["修改"] =  0.5  } , 
{["类型"] =  16 ,["偏移"] =  12  , ["冻结"] =  false  , ["修改"] =  0.5  } , 
} LongTao(tb1, tb2)
end

function HS116()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  20.0  } , 
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  20.0  },
{["类型"]=  16  ,["偏移"]=  8  ,["副特征码"]=  20.0  },
{["类型"]=  16  ,["偏移"]=  12  ,["副特征码"]=  20.0  },
}
 local tb2={ 
{["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  50.0  } , 
{["类型"] =  16 ,["偏移"] =  4  , ["冻结"] =  false  , ["修改"] =  50.0  } , 
{["类型"] =  16 ,["偏移"] =  8  , ["冻结"] =  false  , ["修改"] =  50.0  } , 
{["类型"] =  16 ,["偏移"] =  12  , ["冻结"] =  false  , ["修改"] =  50.0  } , 
} LongTao(tb1, tb2)
end

function HS33()
gg.setRanges(32)
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  0.029999999329447746  } , 
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  0.05000000074505806  },
{["类型"]=  16  ,["偏移"]=  8  ,["副特征码"]=  0.07500000298023224  },
{["类型"]=  16  ,["偏移"]=  12  ,["副特征码"]=  0.125  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  0.125  } , 
 {["类型"] =  16 ,["偏移"] =  4  , ["冻结"] =  false  , ["修改"] =  0.125  } ,
 {["类型"] =  16 ,["偏移"] =  8  , ["冻结"] =  false  , ["修改"] =  0.125  } ,
 {["类型"] =  16 ,["偏移"] =  12  , ["冻结"] =  false  , ["修改"] =  0.125  } ,
} LongTao(tb1, tb2)
end


function HS117()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  30.0  } , 
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  30.0  },
{["类型"]=  16  ,["偏移"]=  8  ,["副特征码"]=  30.0  },
{["类型"]=  16  ,["偏移"]=  12  ,["副特征码"]=  30.0  },
}
 local tb2={ 
{["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  50.0  } , 
{["类型"] =  16 ,["偏移"] =  4  , ["冻结"] =  false  , ["修改"] =  50.0  } , 
{["类型"] =  16 ,["偏移"] =  8  , ["冻结"] =  false  , ["修改"] =  50.0  } , 
{["类型"] =  16 ,["偏移"] =  12  , ["冻结"] =  false  , ["修改"] =  50.0  } , 
} LongTao(tb1, tb2)
end

function HS34()
gg.setRanges(32)
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  0.10000000149011612  } , 
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  0.15000000596046448  },
{["类型"]=  16  ,["偏移"]=  8  ,["副特征码"]=  0.25  },
{["类型"]=  16  ,["偏移"]=  12  ,["副特征码"]=  0.4000000059604645  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  0.4  } , 
 {["类型"] =  16 ,["偏移"] =  4  , ["冻结"] =  false  , ["修改"] =  0.4  } ,
 {["类型"] =  16 ,["偏移"] =  8  , ["冻结"] =  false  , ["修改"] =  0.4  } ,
 {["类型"] =  16 ,["偏移"] =  12  , ["冻结"] =  false  , ["修改"] =  0.4  } ,
} LongTao(tb1, tb2)
end

function HS39()
	 Main0()
end

function Main36()
SN = gg.multiChoice({
	 "兔兔变身金币下调",
	 "哎呀好痛、来抓我呀概率上调",
	 "返回功能主页",
}, nil, "")
if SN[1]==true then
	 HS37()
end
if SN[2]==true then
	 HS38()
end
if SN[3]==true then
	 HS40()
end
FX1=0
end

function HS37()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  80.0  } , 
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  60.0  },
{["类型"]=  16  ,["偏移"]=  8  ,["副特征码"]=  40.0  },
{["类型"]=  16  ,["偏移"]=  12  ,["副特征码"]=  1.0  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  -200  } , 
 {["类型"] =  16 ,["偏移"] =  4  , ["冻结"] =  false  , ["修改"] =  -200  } , 
 {["类型"] =  16 ,["偏移"] =  8  , ["冻结"] =  false  , ["修改"] =  -200  } , 
 {["类型"] =  16 ,["偏移"] =  12  , ["冻结"] =  false  , ["修改"] =  -200  } , 
} LongTao(tb1, tb2)
end

function HS38()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  0.20000000298023224  } , 
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  0.25  },
{["类型"]=  16  ,["偏移"]=  8  ,["副特征码"]=  0.4000000059604645  },
{["类型"]=  16  ,["偏移"]=  12  ,["副特征码"]=  0.6000000238418579  },
{["类型"]=  16  ,["偏移"]=  320  ,["副特征码"]=  0.20000000298023224  },
{["类型"]=  16  ,["偏移"]=  324  ,["副特征码"]=  0.25  },
{["类型"]=  16  ,["偏移"]=  328  ,["副特征码"]=  0.4000000059604645  },
{["类型"]=  16  ,["偏移"]=  332  ,["副特征码"]=  0.6000000238418579  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  0.6  } , 
 {["类型"] =  16 ,["偏移"] =  4  , ["冻结"] =  false  , ["修改"] =  0.6  } , 
 {["类型"] =  16 ,["偏移"] =  8  , ["冻结"] =  false  , ["修改"] =  0.6  } , 
 {["类型"] =  16 ,["偏移"] =  12  , ["冻结"] =  false  , ["修改"] =  0.6  } , 
 {["类型"] =  16 ,["偏移"] =  320  , ["冻结"] =  false  , ["修改"] =  0.6  } , 
 {["类型"] =  16 ,["偏移"] =  324  , ["冻结"] =  false  , ["修改"] =  0.6  } , 
 {["类型"] =  16 ,["偏移"] =  328  , ["冻结"] =  false  , ["修改"] =  0.6  } , 
 {["类型"] =  16 ,["偏移"] =  332  , ["冻结"] =  false  , ["修改"] =  0.6  } , 
} LongTao(tb1, tb2)
end

function HS40()
	 Main0()
end

function Main42()
SN = gg.multiChoice({
	 "替身木偶持续时间上调",
	 "移形换位冷却时间下调",
	 "变羊术概率上调",
	 "返回功能主页",
}, nil, "")
if SN[1]==true then
	 HS43()
end
if SN[2]==true then
	 HS44()
end
if SN[3]==true then
	 HS45()
end
if SN[4]==true then
	 HS47()
end
FX1=0
end

function HS43()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  40.0  } , 
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  55.0  },
{["类型"]=  16  ,["偏移"]=  8  ,["副特征码"]=  70.0  },
{["类型"]=  16  ,["偏移"]=  12  ,["副特征码"]=  100.0  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  100  } , 
 {["类型"] =  16 ,["偏移"] =  4  , ["冻结"] =  false  , ["修改"] =  100  } , 
 {["类型"] =  16 ,["偏移"] =  8  , ["冻结"] =  false  , ["修改"] =  100  } , 
 {["类型"] =  16 ,["偏移"] =  12  , ["冻结"] =  false  , ["修改"] =  100  } , 
} LongTao(tb1, tb2)
end

function HS44()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  70.0  } , 
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  60.0  },
{["类型"]=  16  ,["偏移"]=  8  ,["副特征码"]=  50.0  },
{["类型"]=  16  ,["偏移"]=  12  ,["副特征码"]=  30.0  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  30  } , 
 {["类型"] =  16 ,["偏移"] =  4  , ["冻结"] =  false  , ["修改"] =  30  } , 
 {["类型"] =  16 ,["偏移"] =  8  , ["冻结"] =  false  , ["修改"] =  30  } , 
 {["类型"] =  16 ,["偏移"] =  12  , ["冻结"] =  false  , ["修改"] =  30  } , 
} LongTao(tb1, tb2)
end

function HS45()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  0.07999999821186066  } , 
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  0.10000000149011612  },
{["类型"]=  16  ,["偏移"]=  8  ,["副特征码"]=  0.15000000596046448  },
{["类型"]=  16  ,["偏移"]=  12  ,["副特征码"]=  0.20000000298023224  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  0.2  } , 
 {["类型"] =  16 ,["偏移"] =  4  , ["冻结"] =  false  , ["修改"] =  0.2  } , 
 {["类型"] =  16 ,["偏移"] =  8  , ["冻结"] =  false  , ["修改"] =  0.2  } , 
 {["类型"] =  16 ,["偏移"] =  12  , ["冻结"] =  false  , ["修改"] =  0.2  } , 
} LongTao(tb1, tb2)
end

function HS47()
	 Main0()
end

function Main48()
SN = gg.multiChoice({
	 "天降之物冷却时间下调",
	 "充能次数上调",
	 "自我恢复冷却时间下调",
	 "返回功能主页",
}, nil, "")
if SN[1]==true then
	 HS49()
end
if SN[2]==true then
	 HS50()
end
if SN[3]==true then
	 HS51()
end
if SN[4]==true then
	 HS52()
end
FX1=0
end

function HS49()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  60.0  } , 
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  50.0  },
{["类型"]=  16  ,["偏移"]=  8  ,["副特征码"]=  40.0  },
{["类型"]=  16  ,["偏移"]=  12  ,["副特征码"]=  20.0  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  20  } , 
 {["类型"] =  16 ,["偏移"] =  4  , ["冻结"] =  false  , ["修改"] =  20  } , 
 {["类型"] =  16 ,["偏移"] =  8  , ["冻结"] =  false  , ["修改"] =  20  } , 
 {["类型"] =  16 ,["偏移"] =  12  , ["冻结"] =  false  , ["修改"] =  20  } , 
} LongTao(tb1, tb2)
end

function HS50()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  2.0  } , 
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  3.0  },
{["类型"]=  16  ,["偏移"]=  8  ,["副特征码"]=  4.0  },
{["类型"]=  16  ,["偏移"]=  12  ,["副特征码"]=  5.0  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  5  } , 
 {["类型"] =  16 ,["偏移"] =  4  , ["冻结"] =  false  , ["修改"] =  5  } , 
 {["类型"] =  16 ,["偏移"] =  8  , ["冻结"] =  false  , ["修改"] =  5  } , 
} LongTao(tb1, tb2)
end

function HS51()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  25.0  } , 
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  20.0  },
{["类型"]=  16  ,["偏移"]=  8  ,["副特征码"]=  16.0  },
{["类型"]=  16  ,["偏移"]=  12  ,["副特征码"]=  8.0  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  8  } , 
 {["类型"] =  16 ,["偏移"] =  4  , ["冻结"] =  false  , ["修改"] =  8  } , 
 {["类型"] =  16 ,["偏移"] =  8  , ["冻结"] =  false  , ["修改"] =  8  } , 
} LongTao(tb1, tb2)
end

function HS52()
	 Main0()
end

function Main53()
SN = gg.multiChoice({
	 "甜心锁链冷却下调",
	 "灵狐闪现金币下调",
	 "治愈灵波恢复血量上调",
	 "返回功能主页",
}, nil, "")
if SN[1]==true then
	 HS54()
end
if SN[2]==true then
	 HS55()
end
if SN[3]==true then
	 HS56()
end
if SN[4]==true then
	 HS57()
end
FX1=0
end

function HS54()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  30.0  } , 
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  28.0  },
{["类型"]=  16  ,["偏移"]=  8  ,["副特征码"]=  24.0  },
{["类型"]=  16  ,["偏移"]=  12  ,["副特征码"]=  20.0  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  20  } , 
 {["类型"] =  16 ,["偏移"] =  4  , ["冻结"] =  false  , ["修改"] =  20  } , 
 {["类型"] =  16 ,["偏移"] =  8  , ["冻结"] =  false  , ["修改"] =  20  } , 
} LongTao(tb1, tb2)
end

function HS55()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  90.0  } , 
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  80.0  },
{["类型"]=  16  ,["偏移"]=  8  ,["副特征码"]=  70.0  },
{["类型"]=  16  ,["偏移"]=  12  ,["副特征码"]=  50.0  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  1  } , 
 {["类型"] =  16 ,["偏移"] =  4  , ["冻结"] =  false  , ["修改"] =  1  } , 
 {["类型"] =  16 ,["偏移"] =  8  , ["冻结"] =  false  , ["修改"] =  1  } , 
 {["类型"] =  16 ,["偏移"] =  12  , ["冻结"] =  false  , ["修改"] =  1  } , 
} LongTao(tb1, tb2)
end

function HS56()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  5.0  } , 
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  10.0  },
{["类型"]=  16  ,["偏移"]=  8  ,["副特征码"]=  15.0  },
{["类型"]=  16  ,["偏移"]=  12  ,["副特征码"]=  20.0  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  20  } , 
 {["类型"] =  16 ,["偏移"] =  4  , ["冻结"] =  false  , ["修改"] =  20  } , 
 {["类型"] =  16 ,["偏移"] =  8  , ["冻结"] =  false  , ["修改"] =  20  } , 
} LongTao(tb1, tb2)
end

function HS57()
	 Main0()
end

function Main58()
SN = gg.multiChoice({
	 "会心一击概率上调",
	 "浑身有劲概率上调",
	 "再来一发概率上调",
	 "返回功能主页",
}, nil, "")
if SN[1]==true then
	 HS59()
end
if SN[2]==true then
	 HS60()
end
if SN[3]==true then
	 HS61()
end
if SN[4]==true then
	 HS62()
end
FX1=0
end

function HS59()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  0.029999999329447746  } , 
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  0.04500000178813934  },
{["类型"]=  16  ,["偏移"]=  8  ,["副特征码"]=  0.09000000357627869  },
{["类型"]=  16  ,["偏移"]=  12  ,["副特征码"]=  0.18000000715255737  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  0.18  } , 
 {["类型"] =  16 ,["偏移"] =  4  , ["冻结"] =  false  , ["修改"] =  0.18  } , 
 {["类型"] =  16 ,["偏移"] =  8  , ["冻结"] =  false  , ["修改"] =  0.18  } , 
 {["类型"] =  16 ,["偏移"] =  12  , ["冻结"] =  false  , ["修改"] =  0.18  } , 
} LongTao(tb1, tb2)
end

function HS60()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  0.10000000149011612  } , 
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  0.1599999964237213  },
{["类型"]=  16  ,["偏移"]=  8  ,["副特征码"]=  0.23999999463558197  },
{["类型"]=  16  ,["偏移"]=  12  ,["副特征码"]=  0.4000000059604645  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  0.4  } , 
 {["类型"] =  16 ,["偏移"] =  4  , ["冻结"] =  false  , ["修改"] =  0.4  } , 
 {["类型"] =  16 ,["偏移"] =  8  , ["冻结"] =  false  , ["修改"] =  0.4  } , 
 {["类型"] =  16 ,["偏移"] =  12  , ["冻结"] =  false  , ["修改"] =  0.4  } , 
} LongTao(tb1, tb2)
end

function HS61()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  0.029999999329447746  } , 
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  0.05999999865889549  },
{["类型"]=  16  ,["偏移"]=  8  ,["副特征码"]=  0.10000000149011612  },
{["类型"]=  16  ,["偏移"]=  12  ,["副特征码"]=  0.18000000715255737  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  0.18  } , 
 {["类型"] =  16 ,["偏移"] =  4  , ["冻结"] =  false  , ["修改"] =  0.18  } , 
 {["类型"] =  16 ,["偏移"] =  8  , ["冻结"] =  false  , ["修改"] =  0.18  } , 
 {["类型"] =  16 ,["偏移"] =  12  , ["冻结"] =  false  , ["修改"] =  0.18  } , 
} LongTao(tb1, tb2)
end

function HS62()
	 Main0()
end

function Main63()
SN = gg.multiChoice({
	 "隐身冷却时间下调",
	 "自制陷阱冷却时间下调",
	 "天降正义冷却时间下调",
	 "返回功能主页",
}, nil, "")
if SN[1]==true then
	 HS64()
end
if SN[2]==true then
	 HS65()
end
if SN[3]==true then
	 HS66()
end
if SN[4]==true then
	 HS67()
end
FX1=0
end

function HS64()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  18.0  } , 
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  16.0  },
{["类型"]=  16  ,["偏移"]=  8  ,["副特征码"]=  14.0  },
{["类型"]=  16  ,["偏移"]=  12  ,["副特征码"]=  10.0  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  10  } , 
 {["类型"] =  16 ,["偏移"] =  4  , ["冻结"] =  false  , ["修改"] =  10  } , 
 {["类型"] =  16 ,["偏移"] =  8  , ["冻结"] =  false  , ["修改"] =  10  } , 
} LongTao(tb1, tb2)
end

function HS65()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  180.0  } , 
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  150.0  },
{["类型"]=  16  ,["偏移"]=  8  ,["副特征码"]=  120.0  },
{["类型"]=  16  ,["偏移"]=  12  ,["副特征码"]=  60.0  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  60  } , 
 {["类型"] =  16 ,["偏移"] =  4  , ["冻结"] =  false  , ["修改"] =  60  } , 
 {["类型"] =  16 ,["偏移"] =  8  , ["冻结"] =  false  , ["修改"] =  60  } , 
} LongTao(tb1, tb2)
end

function HS66()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  50.0  } , 
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  40.0  },
{["类型"]=  16  ,["偏移"]=  8  ,["副特征码"]=  30.0  },
{["类型"]=  16  ,["偏移"]=  12  ,["副特征码"]=  15.0  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  15  } , 
 {["类型"] =  16 ,["偏移"] =  4  , ["冻结"] =  false  , ["修改"] =  15  } , 
 {["类型"] =  16 ,["偏移"] =  8  , ["冻结"] =  false  , ["修改"] =  15  } , 
} LongTao(tb1, tb2)
end

function HS67()
	 Main0()
end

function Main68()
SN = gg.multiChoice({
	 "喷射飞行持续时间上调",
	 "迷你雷达冷却下调",
	 "声波探测持续时间上调",
	 "返回功能主页",
}, nil, "")
if SN[1]==true then
	 HS69()
end
if SN[2]==true then
	 HS70()
end
if SN[3]==true then
	 HS71()
end
if SN[4]==true then
	 HS72()
end
FX1=0
end

function HS69()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  6.0  } , 
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  8.0  },
{["类型"]=  16  ,["偏移"]=  8  ,["副特征码"]=  10.0  },
{["类型"]=  16  ,["偏移"]=  12  ,["副特征码"]=  14.0  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  14  } , 
 {["类型"] =  16 ,["偏移"] =  4  , ["冻结"] =  false  , ["修改"] =  14  } , 
 {["类型"] =  16 ,["偏移"] =  8  , ["冻结"] =  false  , ["修改"] =  14  } , 
} LongTao(tb1, tb2)
end

function HS70()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  120.0  } , 
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  100.0  },
{["类型"]=  16  ,["偏移"]=  8  ,["副特征码"]=  80.0  },
{["类型"]=  16  ,["偏移"]=  12  ,["副特征码"]=  40.0  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  40  } , 
 {["类型"] =  16 ,["偏移"] =  4  , ["冻结"] =  false  , ["修改"] =  40  } , 
 {["类型"] =  16 ,["偏移"] =  8  , ["冻结"] =  false  , ["修改"] =  40  } , 
} LongTao(tb1, tb2)
end

function HS71()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  1.5  } , 
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  2.5  },
{["类型"]=  16  ,["偏移"]=  8  ,["副特征码"]=  4.0  },
{["类型"]=  16  ,["偏移"]=  12  ,["副特征码"]=  7.0  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  7  } , 
 {["类型"] =  16 ,["偏移"] =  4  , ["冻结"] =  false  , ["修改"] =  7  } , 
 {["类型"] =  16 ,["偏移"] =  8  , ["冻结"] =  false  , ["修改"] =  7  } , 
} LongTao(tb1, tb2)
end

function HS72()
	 Main0()
end

function Main73()
SN = gg.multiChoice({
	 "能量禁锢冷却时间下调",
	 "机械改造金币下调",
	 "火力压制概率上调",
	 "返回功能主页",
}, nil, "")
if SN[1]==true then
	 HS74()
end
if SN[2]==true then
	 HS75()
end
if SN[3]==true then
	 HS76()
end
if SN[4]==true then
	 HS77()
end
FX1=0
end

function HS74()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  14.0  } , 
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  12.0  },
{["类型"]=  16  ,["偏移"]=  8  ,["副特征码"]=  10.0  },
{["类型"]=  16  ,["偏移"]=  12  ,["副特征码"]=  6.0  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  6  } , 
 {["类型"] =  16 ,["偏移"] =  4  , ["冻结"] =  false  , ["修改"] =  6  } , 
 {["类型"] =  16 ,["偏移"] =  8  , ["冻结"] =  false  , ["修改"] =  6  } , 
} LongTao(tb1, tb2)
end

function HS75()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  230.0  } , 
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  200.0  },
{["类型"]=  16  ,["偏移"]=  8  ,["副特征码"]=  170.0  },
{["类型"]=  16  ,["偏移"]=  12  ,["副特征码"]=  120.0  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  -200  } , 
 {["类型"] =  16 ,["偏移"] =  4  , ["冻结"] =  false  , ["修改"] =  -200  } , 
 {["类型"] =  16 ,["偏移"] =  8  , ["冻结"] =  false  , ["修改"] =  -200  } , 
 {["类型"] =  16 ,["偏移"] =  12  , ["冻结"] =  false  , ["修改"] =  -200  } , 
} LongTao(tb1, tb2)
end

function HS76()
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  0.07999999821186066  } , 
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  0.10000000149011612  },
{["类型"]=  16  ,["偏移"]=  8  ,["副特征码"]=  0.15000000596046448  },
{["类型"]=  16  ,["偏移"]=  12  ,["副特征码"]=  0.25  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  0.25  } , 
 {["类型"] =  16 ,["偏移"] =  4  , ["冻结"] =  false  , ["修改"] =  0.25  } , 
 {["类型"] =  16 ,["偏移"] =  8  , ["冻结"] =  false  , ["修改"] =  0.25  } , 
} LongTao(tb1, tb2)
end

function HS77()
	 Main0()
end

function HS78()
	 Main0()
end

function Main79()
SN = gg.multiChoice({
	 "微范围开锁（局内开启）",
	 "微加速开锁（一局一开）",
	 "亮透视（一局一开）(二选一)",
	 "暗透视(一局一开)(二选一)",
	 "视角拉远（一局一开）",
	 "防封（一局一开）",
	 "返回功能主页",
}, nil, "微范围开锁只用在局内开启一次，效果就会持续到大退游戏，其他的需要每局都要开启一次。")
if SN[1]==true then
	 HS80()
end
if SN[2]==true then
	 HS81()
end
if SN[3]==true then
	 HS82()
end
if SN[4]==true then
	 HS148()
end
if SN[5]==true then
	 HS83()
end
if SN[6]==true then
	 HS115()
end
if SN[7]==true then
	 HS84()
end
FX1=0
end

function HS80()
	 gg.clearResults()
	 gg.setRanges(32)
	 gg.searchNumber("1.2999999523162842", gg.TYPE_FLOAT, false, gg.SIGN_EQUAL, 0, -1)
	 gg.searchNumber("", gg.TYPE_FLOAT, false, gg.SIGN_EQUAL, 0, -1)
	 gg.getResults(100)
	 gg.editAll("2", gg.TYPE_FLOAT)
	 gg.toast("微范围开锁修改成功")
	 gg.clearResults()
end

function HS81()
	 gg.clearResults()
	 gg.setRanges(32)
	 gg.searchNumber("1.2215520886178692E-38", gg.TYPE_FLOAT, false, gg.SIGN_EQUAL, 0, -1)
	 gg.searchNumber("", gg.TYPE_FLOAT, false, gg.SIGN_EQUAL, 0, -1)
	 gg.getResults(100)
	 gg.editAll("1.7", gg.TYPE_FLOAT)
	 gg.toast("微加速开锁修改成功")
	 gg.clearResults()
end

function HS82()
	 gg.clearResults()
	 gg.setRanges(32)
	 gg.searchNumber("16.62690544128", gg.TYPE_FLOAT, false, gg.SIGN_EQUAL, 0, -1)
	 gg.searchNumber("", gg.TYPE_FLOAT, false, gg.SIGN_EQUAL, 0, -1)
	 gg.getResults(100)
	 gg.editAll("50", gg.TYPE_FLOAT)
	 gg.toast("视野透视开启成功")
	 gg.clearResults()
end

function HS148()
local tb1={ 
{["类型"] =  4  ,["主特征码"] =  230887  } , 
{["类型"]=  16  ,["偏移"]=  4  ,["副特征码"]=  16.62690544128418  },
{["类型"]=  4  ,["偏移"]=  12  ,["副特征码"]=  1  },
{["类型"]=  16  ,["偏移"]=  24  ,["副特征码"]=  3.2354159853256404E-40  },
}
 local tb2={ 
 {["类型"] =  4 ,["偏移"] =  12  , ["冻结"] =  false  , ["修改"] =  0  } , 
} LongTao(tb1, tb2)
end

function HS83()
  gg.setRanges(gg.REGION_ANONYMOUS)
local tb1={ 
{["类型"] =  16  ,["主特征码"] =  12.0  } , 
{["类型"]=  16  ,["偏移"]=  -96  ,["副特征码"]=  6.0  },
{["类型"]=  16  ,["偏移"]=  -76  ,["副特征码"]=  6.0  },
{["类型"]=  16  ,["偏移"]=  -72  ,["副特征码"]=  6.0  },
{["类型"]=  16  ,["偏移"]=  -68  ,["副特征码"]=  10.0  },
{["类型"]=  16  ,["偏移"]=  -64  ,["副特征码"]=  30.0  },
{["类型"]=  16  ,["偏移"]=  -16  ,["副特征码"]=  10.0  },
}
 local tb2={ 
 {["类型"] =  16 ,["偏移"] =  0  , ["冻结"] =  false  , ["修改"] =  20.0  } , 
} LongTao(tb1, tb2)
end

function HS115()
	 gg.clearResults()
	 gg.setRanges(32)
	 gg.searchNumber("2;3;5;1.5", gg.TYPE_FLOAT, false, gg.SIGN_EQUAL, 0, -1)
	 gg.searchNumber("3", gg.TYPE_FLOAT, false, gg.SIGN_EQUAL, 0, -1)
	 gg.getResults(100)
	 gg.editAll("9999", gg.TYPE_FLOAT)
	 gg.toast("防封开启成功")
	 gg.clearResults()
end

function HS84()
	 Main0()
end

function Main87()
SN = gg.multiChoice({
	 "火箭筒10连射",
	 "火箭筒连射恢复",
	 "火箭筒无后坐力（无法恢复）",
	 "火箭筒弹夹20发",
	 "火箭筒弹夹恢复",
	 "冲锋枪60连发",
	 "冲锋枪连射恢复",
	 "迫击炮10连发",
	 "迫击炮连射恢复",
	 "迫击炮全屏伤害（轰一炮再开）",
	 "返回功能主页",
}, nil, "仅适合大乱斗使用，可实战，但不要打82和41！否则有封号风险！\n都是在在大厅开启的，只有迫击炮全屏在局内开启！")
if SN[1]==true then
	 HS88()
end
if SN[2]==true then
	 HS100()
end
if SN[3]==true then
	 HS89()
end
if SN[4]==true then
	 HS90()
end
if SN[5]==true then
	 HS101()
end
if SN[6]==true then
	 HS91()
end
if SN[7]==true then
	 HS102()
end
if SN[8]==true then
	 HS92()
end
if SN[9]==true then
	 HS103()
end
if SN[10]==true then
	 HS93()
end
if SN[11]==true then
	 HS104()
end
FX1=0
end

function HS88()
	 gg.clearResults()
	 gg.setRanges(32)
	 gg.searchNumber("56F;1;1.1F::13", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
	 gg.searchNumber("1", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
	 gg.getResults(100)
	 gg.editAll("10", gg.TYPE_DWORD)
	 gg.toast("不要打41和82！")
	 gg.clearResults()
end

function HS100()
	 gg.clearResults()
	 gg.setRanges(32)
	 gg.searchNumber("56F;10;1.1F", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
	 gg.searchNumber("10", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
	 gg.getResults(100)
	 gg.editAll("1", gg.TYPE_DWORD)
	 gg.toast("火箭筒连射恢复成功")
	 gg.clearResults()
end

function HS89()
	 gg.clearResults()
	 gg.setRanges(32)
	 gg.searchNumber("100D;56;1", gg.TYPE_FLOAT, false, gg.SIGN_EQUAL, 0, -1)
	 gg.searchNumber("1", gg.TYPE_FLOAT, false, gg.SIGN_EQUAL, 0, -1)
	 gg.getResults(100)
	 gg.editAll("0", gg.TYPE_FLOAT)
	 gg.toast("不要打41和82！")
	 gg.clearResults()
end

function HS90()
	 gg.clearResults()
	 gg.setRanges(32)
	 gg.searchNumber("56F;4;1.1F::13", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
	 gg.searchNumber("4", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
	 gg.getResults(100)
	 gg.editAll("20", gg.TYPE_DWORD)
	 gg.toast("不要打41和82！")
	 gg.clearResults()
end

function HS101()
	 gg.clearResults()
	 gg.setRanges(32)
	 gg.searchNumber("56F;20;1.1F::13", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
	 gg.searchNumber("20", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
	 gg.getResults(100)
	 gg.editAll("4", gg.TYPE_DWORD)
	 gg.toast("火箭筒弹夹恢复成功")
	 gg.clearResults()
end

function HS91()
	 gg.clearResults()
	 gg.setRanges(32)
	 gg.searchNumber("10F;6;1.1F", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
	 gg.searchNumber("6", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
	 gg.getResults(100)
	 gg.editAll("60", gg.TYPE_DWORD)
	 gg.toast("不要打41和82！")
	 gg.clearResults()
end

function HS102()
	 gg.clearResults()
	 gg.setRanges(32)
	 gg.searchNumber("10F;60;1.1F::13", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
	 gg.searchNumber("60", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
	 gg.getResults(100)
	 gg.editAll("6", gg.TYPE_DWORD)
	 gg.toast("冲锋枪连射恢复成功")
	 gg.clearResults()
end

function HS92()
	 gg.clearResults()
	 gg.setRanges(32)
	 gg.searchNumber("99F;1;1.1F::13", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
	 gg.searchNumber("1", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
	 gg.getResults(100)
	 gg.editAll("10", gg.TYPE_DWORD)
	 gg.toast("不要打41和82！")
	 gg.clearResults()
end

function HS103()
	 gg.clearResults()
	 gg.setRanges(32)
	 gg.searchNumber("99F;10;1.1F", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
	 gg.searchNumber("10", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
	 gg.getResults(100)
	 gg.editAll("1", gg.TYPE_DWORD)
	 gg.toast("迫击炮连射恢复")
	 gg.clearResults()
end

function HS93()
	 gg.clearResults()
	 gg.setRanges(32)
	 gg.searchNumber("99;2", gg.TYPE_FLOAT, false, gg.SIGN_EQUAL, 0, -1)
	 gg.searchNumber("2", gg.TYPE_FLOAT, false, gg.SIGN_EQUAL, 0, -1)
	 gg.getResults(100)
	 gg.editAll("9999", gg.TYPE_FLOAT)
	 gg.toast("不要打41和82！")
	 gg.clearResults()
end

function HS104()
	 Main0()
end

function Main113()
SN = gg.multiChoice({
	 "防封开启（一局一开）",
	 "防封①（大厅开启）",
	 "防封②（大厅开启）",
	 "防封③（大厅开启）",
	 "防封④（大厅开启）",
	 "防封⑤（大厅开启）",
	 "返回功能主页",
}, nil, "此防封是为了防止游戏内因系统数据异常而闪退，闪退之后是可以重进进入游戏且不封号的，如果封号了那就是开了些变态功能，变态功能理论上指的是本地数据库和云端数据库对不上（本脚本内没有类似功能），这个闪退之后重进不封号无所谓，但会影响到局内体验，因为重进后要重新开启功能，要耗费大量时间开启，若功能开启期间没有强大的技术基础可能被技术大佬爆揍！非常影响游戏体验！所以专门针对以上情况制作了此防封，这个防封是无法防止高频举报的！所以请务必收敛点！")
if SN[1]==true then
	 HS114()
end
if SN[2]==true then
	 HS118()
end
if SN[3]==true then
	 HS119()
end
if SN[4]==true then
	 HS120()
end
if SN[5]==true then
	 HS121()
end
if SN[6]==true then
	 HS122()
end
if SN[7]==true then
	 HS123()
end
FX1=0
end

function HS114()
	 gg.clearResults()
	 gg.setRanges(32)
	 gg.searchNumber("2;3;5;1.5", gg.TYPE_FLOAT, false, gg.SIGN_EQUAL, 0, -1)
	 gg.searchNumber("3", gg.TYPE_FLOAT, false, gg.SIGN_EQUAL, 0, -1)
	 gg.getResults(100)
	 gg.editAll("99999", gg.TYPE_FLOAT)
	 gg.toast("防封开启成功")
	 gg.clearResults()
end

function HS118()
	 gg.clearResults()
	 gg.setRanges(32)
	 gg.searchNumber("30001", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
	 gg.searchNumber("", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
	 jg=gg.getResults(100)
	 sl=gg.getResultCount()
	 if sl>100 then sl=100 end
	 for i = 1, sl do
	 	 dzy=jg[i].address
	 	 gg.addListItems({[1] = {address = dzy,flags = gg.TYPE_DWORD,freeze = true,value = 0}})
	 end
	 gg.toast("防封①开启成功")
	 gg.clearResults()
end

function HS119()
	 gg.clearResults()
	 gg.setRanges(32)
	 gg.searchNumber("30094", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
	 gg.searchNumber("", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
	 jg=gg.getResults(100)
	 sl=gg.getResultCount()
	 if sl>100 then sl=100 end
	 for i = 1, sl do
	 	 dzy=jg[i].address
	 	 gg.addListItems({[1] = {address = dzy,flags = gg.TYPE_DWORD,freeze = true,value = 0}})
	 end
	 gg.toast("防封②开启成功")
	 gg.clearResults()
end

function HS120()
	 gg.clearResults()
	 gg.setRanges(32)
	 gg.searchNumber("30104", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
	 gg.searchNumber("", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
	 jg=gg.getResults(100)
	 sl=gg.getResultCount()
	 if sl>100 then sl=100 end
	 for i = 1, sl do
	 	 dzy=jg[i].address
	 	 gg.addListItems({[1] = {address = dzy,flags = gg.TYPE_DWORD,freeze = true,value = 0}})
	 end
	 gg.toast("防封③开启成功")
	 gg.clearResults()
end

function HS121()
	 gg.clearResults()
	 gg.setRanges(32)
	 gg.searchNumber("30750", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
	 gg.searchNumber("", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
	 jg=gg.getResults(100)
	 sl=gg.getResultCount()
	 if sl>100 then sl=100 end
	 for i = 1, sl do
	 	 dzy=jg[i].address
	 	 gg.addListItems({[1] = {address = dzy,flags = gg.TYPE_DWORD,freeze = true,value = 0}})
	 end
	 gg.toast("防封④开启成功")
	 gg.clearResults()
end

function HS122()
	 gg.clearResults()
	 gg.setRanges(32)
	 gg.searchNumber("30751", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
	 gg.searchNumber("", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
	 jg=gg.getResults(100)
	 sl=gg.getResultCount()
	 if sl>100 then sl=100 end
	 for i = 1, sl do
	 	 dzy=jg[i].address
	 	 gg.addListItems({[1] = {address = dzy,flags = gg.TYPE_DWORD,freeze = true,value = 0}})
	 end
	 gg.toast("防封⑤开启成功")
	 gg.clearResults()
end

function HS123()
	 Main0()
end

function Main126()
SN = gg.choice({
	 "4399版本解封(桌面开启)",
	 "应用宝版本解封(桌面开启)",
	 "九游版解封(桌面开启)",
	 "其他版本解封(游戏运行时开启)",
	 "返回功能主页",
}, nil, "这仅是解设备，不是解账号被封的，如果非要解封请用嘴炮和官方说去[🐶]")
if SN==1 then
	 HS127()
end
if SN==2 then
	 HS128()
end
if SN==3 then
	 HS129()
end
if SN==4 then
	 HS130()
end
if SN==5 then
	 HS131()
end
FX1=0
end

function HS127()
WJ="/storage/emulated/0/Android/data/com.bairimeng.dmmdzz.m4399/files/VirtualUniqueDeviceID.txt"
ID = gg.prompt({[1]="请随机输入一串数字"},{[1]=""},{[1]="text"})
if ID == nil then gg.toast("您选择了取消") else
if ID[1] == "" then gg.alert("不能输入为空") end
io.open(WJ,"w"):write(ID[1]):close()
gg.alert("解封成功\n请登录游客账号或其他账号")
end
end


function HS128()
	WJ2="/storage/emulated/0/Android/data/com.tencent.tmgp.bairimeng.dmmdzz/files/VirtualUniqueDeviceID.txt"
ID2 = gg.prompt({[1]="请随机输入一串数字"},{[1]=""},{[1]="text"})
if ID2 == nil then gg.alert("您选择了取消") else
if ID2[1] == "" then gg.alert("不能输入为空") os.exit() end
io.open(WJ2,"w"):write(ID2[1]):close()
gg.alert("解封成功\n请登录游客账号或其他账号")
end
end

function HS129()
	 WJ1="/storage/emulated/0/Android/data/com.bairimeng.dmmdzz.uc/files/VirtualUniqueDeviceID.txt"
ID1 = gg.prompt({[1]="请随机输入一串数字"},{[1]=""},{[1]="text"})
if ID1 == nil then gg.alert("您选择了取消") else
if ID1[1] == "" then gg.alert("不能输入为空") os.exit() end
io.open(WJ1,"w"):write(ID1[1]):close()
gg.alert("解封成功\n请登录游客账号或其他账号")
end
end

function HS130()
BW = gg.getTargetPackage()
BM = gg.prompt({[1]="请输入应用包名"},{[1]=BW},{[1]="text"})
if BM == nil then gg.toast("您选择了取消") else
WJ9 = "/storage/emulated/0/Android/data/"..BM[1].."/files/VirtualUniqueDeviceID.txt"
lqc = io.open(WJ9,"r")
if lqc == nil then
gg.alert("解封失败\n目标文件不存在")
else
ID3 = gg.prompt({[1]="请随机输入一串数字"},{[1]=""},{[1]="text"})
if ID3 == nil then gg.toast("您选择了取消") os.exit() end
if ID3[1] == "" then gg.alert("不能输入为空") os.exit() end
io.open(WJ9,"w"):write(ID3[1]):close()
gg.alert("解封成功\n请登录游客账号或其他账号")
end
end
end

function HS131()
	 Main0()
end

function HS85()
     gg.alert("\n欢迎下次使用！")
	 os.exit()
end



while true do
if gg.isVisible(true) then
    FX1 = nil
    gg.setVisible(false)
  end
  if FX1 == nil then
    Main0()
  end
end
-- 46