function G_main()
G_ui=G_main
local main_choise = gg.choice({"👞最新脚本👞·实时更新","👞全部脚本👞","👞其他发布👞·开发中","👞个人中心👞","👞交流中心👞","👞退出程序👞"}, nil, "")
if main_choise==nil then gg.setVisible(false) XGCK = 2 end
if main_choise==1 then load(curl(url.."?lua=newlua"))() end
if main_choise==2 then lua_all() end
if main_choise==3 then gg.alert("开发中，此处会放各种拦截下载") end
if main_choise==4 then load(curl(url.."?lua=userconf"))() end
if main_choise==5 then load(curl(url.."?lua=chat"))() end
if main_choise==6 then os.exit() 
end
end



function lua_all()
G_ui=lua_all
local menu = gg.choice({"👞逃跑吧少年👞","👞和平精英👞","👞逃离塔克夫👞","👞文明重启👞","👞PUBG国体👞","👞迷你世界👞","👞幻塔👞","👞PUBG国际👞","👞穿越火线👞","👞其他脚本👞","👞PUBG轻体👞","👞天天酷跑👞","👞王者荣耀👞","👞香肠派对👞","👞时空召唤👞","👞明日之后👞","👞GG工具👞","👞球球大作战👞","👞全民枪战👞","👞枪战英雄👞","👞我的世界👞","👞QQ飞车👞","👞枪神对决👞","👞荒野乱斗👞","👞火影忍者👞","👞战魂铭人👞","👞原神👞","👞妄想山海👞","👞元气骑士👞","👞使命召唤👞","👞猎魂觉醒👞","👞我功夫特牛👞","👞英雄联盟👞","👞英雄枪战👞","👞小小英雄👞","👞我的勇者👞","👞第五人格👞","👞光·遇👞","👞猫和老鼠👞","👞时空猎人👞","👞忍者必须死👞","👞决战平安京👞","👞荒野行动👞","👞开心消消乐👞","👞弓箭手大作战👞","👞腾讯桌球👞","👞灵魂撕裂👞","👞太空杀👞","👞超凡先锋👞","👞奇葩战斗家👞","返回主页"}, nil, nil)
if menu==1 then G_A1() end
if menu==2 then G_A2() end
if menu==3 then G_A3() end
if menu==4 then G_A4() end
if menu==5 then G_A5() end
if menu==6 then G_A6() end
if menu==7 then G_A7() end
if menu==8 then G_A8() end
if menu==9 then G_A9() end
if menu==10 then G_A10() end
if menu==11 then G_A11() end
if menu==12 then G_A12() end
if menu==13 then G_A13() end
if menu==14 then G_A14() end
if menu==15 then G_A15() end
if menu==16 then G_A16() end
if menu==17 then G_A17() end
if menu==18 then G_A18() end
if menu==19 then G_A19() end
if menu==20 then G_A20() end
if menu==21 then G_A21() end
if menu==22 then G_A22() end
if menu==23 then G_A23() end
if menu==24 then G_A24() end
if menu==25 then G_A25() end
if menu==26 then G_A26() end
if menu==27 then G_A27() end
if menu==28 then G_A28() end
if menu==29 then G_A29() end
if menu==30 then G_A30() end
if menu==31 then G_A31() end
if menu==32 then G_A32() end
if menu==33 then G_A33() end
if menu==34 then G_A34() end
if menu==35 then G_A35() end
if menu==36 then G_A36() end
if menu==37 then G_A37() end
if menu==38 then G_A38() end
if menu==39 then G_A39() end
if menu==40 then G_A40() end
if menu==41 then G_A41() end
if menu==42 then G_A42() end
if menu==43 then G_A43() end
if menu==44 then G_A44() end
if menu==45 then G_A45() end
if menu==46 then G_A46() end
if menu==47 then G_A47() end
if menu==48 then G_A48() end
if menu==49 then G_A49() end
if menu==50 then G_A50() end
if menu==51 then G_main() end
end

function G_A1()
run_lua(({"37e82cc7","20b89b70","0dc903cf","4d8e7269","a405a0b5","a0e1865a","9759ac4f","9dd7fca6","e3ba7016","fc6a1a1d","9336c9c9","47f4f4e7","6fb9d12a","dfcb614f","611de0c3","4ee1b7ab","fa162f0f","3ca7476e","c4f2d627","429190f1","a642b00b","exit"})[gg.choice({"【FY1.5内部破解版】·2天前","【歌自制功能多脚本】·124天前","【恶魔梦恶2.5內部稳定变态上分】·半年前","【［源解］稳定「鸟之风制作」】·一年前","【[源]仙者-逃跑吧少年最终之作】·半年前","【[全源]YXB逃跑稳定脚本3.8】·一年前","【♛万能少年1.4稳定上分♛】·一年前","【逃跑终极外挂辅助脚本】·一年前","【♛万能少年1.6稳定上分♛】·一年前","【[解]『✨鸟之风逃跑脚本✨』】·一年前","【逃跑吧少年无敌脚本】·一年前","【洛神自制3.29】·半年前","【逃生功能】·72天前","【小洛自制4.95(测试版)】·半年前","【解念哥哥逃跑全面脚本】·一年前","【『✨鸟之风逃跑脚本✨』】·一年前","【顾辞逃跑裸奔功能(修复)】·半年前","【[仙]少年い战神解密】·一年前","【（解）逃跑计划】·半年前","【☠︎浩⚠️劫☠︎】·一年前","【꧁龍༒神꧂自制3.2(加密)】·半年前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A2()
run_lua(({"61882650","a9f9f4e5","cce899dc","2c149118","77e23c2a","464cc84a","59a7c66f","a62f8550","5cdd6eae","2921b5bb","1bff5a21","b33c8c5e","314fb0d5","e25e171a","d7ca9228","75e14f8c","89c1db09","0ab1302c","02cb5c89","4db65a67","4f2c6dcb","exit"})[gg.choice({"【和平精英外挂内置防封】·一年前","【香蕉君国体4.0】·一年前","【持枪全图锁人】·一年前","【DAP裸奔午后】·一年前","【VM全防】·一年前","【京康和平国际服5.22超稳变态脚本】·一年前","【啸天国际国体通用2.0】·一年前","【变态脚本（子弹追踪)】·一年前","【晚聽自用】·一年前","【VM功能】·一年前","【老六和平透视】·一年前","【自制】·一年前","【[九瞳]拳霸2.0】·一年前","【邪目牛逼。】·一年前","【和平精英全功能裸奔】·一年前","【和平基址脚本】·一年前","【风尘国服和平全开】·一年前","【诗人全机型透色】·一年前","【纯溪】·一年前","【（解）LG】·一年前","【屠神】·一年前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A3()
run_lua(({"bd6035aa","e313f311","7443c3cc","017ab1fc","4e1f6ddc","ae822e2b","3518492b","83914045","7327c84a","7c8f4b6d","89606be7","cbf62a0e","4e48791c","1ac70b05","19325bc7","2e7dc4aa","249e9749","2fad5628","e975e839","b1b702ed","cabd21e6","exit"})[gg.choice({"【穿墙爬墙】·一年前","【[反]塔科夫整合脚本】·一年前","【天天塔科夫5.5】·一年前","【(全源)狂沙5.2】·一年前","【源码】·一年前","【[反]塔科夫加密】·一年前","【小西瓜全源】·一年前","【olslso(解)】·一年前","【药物科技16.1】·一年前","【660单透】·一年前","【天天塔科夫5.1】·一年前","【秀秀定制范围jm】·半年前","【天天塔科夫4.0】·一年前","【雪乃逃离塔特夫】·一年前","【逃离塔克夫穿墙范围】·一年前","【逃离塔科夫穿墙遁地】·一年前","【蓝细菌塔科夫】·一年前","【塔科夫845透视】·一年前","【塔科夫1.0】·一年前","【塔科夫845透视】·一年前","【狂沙塔科夫7.0】·一年前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A4()
run_lua(({"0b3a3697","3fd1a706","36df0873","80bc1ff5","fcbae2d5","b73ef448","9e006cba","b2bea7da","a831b585","be848c38","d93c83e1","ff903e5b","e80b7272","37451761","baeb76ce","1ca47353","2f2b4126","19b6f103","b78ee4d1","0dabf5ce","4016318a","exit"})[gg.choice({"【全枪无后】·一年前","【原☯️太极牛逼☯️】·一年前","【小兵二改『解』初音2.0】·一年前","【[裸吊解]顾辞科技2.0修复版】·一年前","【神枪手全源9月15破解】·一年前","【[解]🚀神枪手源码🚀】·一年前","【[小小解]疯兔子】·一年前","【果冻开源】·一年前","【卢本伟解钢铁侠全源】·一年前","【疯子破解VIP科技天卡版】·一年前","【残梦制作1.0】·一年前","【源】·一年前","【神枪手全源9月15破解】·一年前","【任平生［解］茄子】·一年前","【过客解魔法】·一年前","【❤️新玄❤️4.0】·一年前","【管理员wdnmd】·一年前","【长安开源海王】·一年前","【船锚内部科技】·一年前","【🐶老狗稳定科技🐶】·一年前","【『子云破解』6.0神仙宫科技】·一年前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A5()
run_lua(({"0f6e28b7","5861d280","57383905","0d0bfa97","caf76809","66158110","5a347be5","a6421ce6","3a79fb01","d03117ac","597a52dd","c4320f9d","20bb97df","16c79544","366928a8","611c8dcb","b97bb215","81b4ae45","c3e938b7","b024664a","exit"})[gg.choice({"【青鱼国体2.0.3】·15天前","【AL国体】·一年前","【墨无国体上分版】·一年前","【[源]啸天脚本2.0】·一年前","【小鹏制作国体变态辅助1.0】·一年前","【香蕉君国体4.6】·一年前","【喵内国体4.5】·一年前","【影天变态脚本0.3】·一年前","【国体枪械美化】·一年前","【国体2.5】·一年前","【CC1.0辅助】·一年前","【多功能国体脚本（范围不减伤）】·15天前","【钢铁套直装功能全源】·9天前","【小鹏国体汽车功能】·一年前","【玲小珑国体仿xs】·一年前","【黑弩国体最强自瞄】·一年前","【神火国体云更整合脚本】·10天前","【国体“多”功能脚本】·128天前","【星辰国体脚本】·128天前","【Rick国际服泛滥版本LSQ】·一年前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A6()
run_lua(({"5065935d","533fd635","9fb714f5","b725505d","81b207f3","8845ce37","7ccf1ccb","f1d027fe","bc4a5612","857c91f6","1a5aa857","0bb2fd81","f14fc381","1fc9e0e6","ead36077","3f0750ba","c9b52c28","f5b49684","5c3f7fe5","5366f5d6","53a62748","exit"})[gg.choice({"【[修复版]迷你世界隔空打人】·2分钟前","【🎁孤仙迷你脚本🎁】·一年前","【天天迷你世界炸图脚本】·147天前","【迷你世界挂】·36天前","【ANK解迷你世界小吴】·半年前","【🌸孤仙迷你脚本🌸】·一年前","【迷你世界终极开挂脚本】·一年前","【☆恒星到来多功能稳定脚本】·一年前","【迷你世界gua】·一年前","【亦云辅助】·一年前","【迷你世界】·一年前","【[鸟之风解]皮哥白嫖MINI多功能整合版(作者无限使用版)u.sebGpp】·一年前","【迷你世界源码脚本】·110天前","【脚本大师V5】·半年前","【[我爱破解]皮哥白嫖MINI多功能整合版(作者无限使用版)u.sebGpp】·一年前","【天天云脚本2.0】·一年前","【迷你世界皮肤】·一年前","【基址裸奔(国际服)】·一年前","【[杰哥解]凉情迷你最新辅助】·125天前","【乐迪迷你辅助】·126天前","【炸图】·半年前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A7()
run_lua(({"9265853e","3559a60d","e2b7587c","a453bedb","aa991962","21ce49e3","4b4826d3","1de49c87","exit"})[gg.choice({"【幻塔功能】·128天前","【幻塔多功能】·128天前","【幻塔(1.1版本)】·127天前","【渡劫幻塔】·127天前","【幻塔3.3】·127天前","【幻塔半夏】·128天前","【幻塔】·128天前","【幻塔1.6免费脚本(修复)】·127天前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A8()
run_lua(({"44e7de45","3557f7dc","ac6e2c9f","ec028176","7859899f","9b7367e5","169f30c0","f2048ba9","63a50025","3d8a187a","6e8ea098","8c294c19","a305185f","10728472","0b9dbc66","ebbb2bef","1d31fe2d","0628acf3","8978bfc1","06c307ac","f1126f48","exit"})[gg.choice({"【Shizuka_Free1.0】·半年前","【国际服神明新版本内防】·一年前","【香蕉君国际服稳内部】·一年前","【咖啡国际服[脚本➕防封]】·一年前","【GOD国际服】·一年前","【全防】·一年前","【啸天全防3.0】·一年前","【香蕉君国际服稳内部】·一年前","【WKX6.0】·一年前","【国体墨无变态徒弟专用说明书(4)】·一年前","【蓝孤国际服源码】·一年前","【小杰国际服(10.28)】·一年前","【[七欢日]利刃9-10】·一年前","【（内部）冷颜9.12国际服变态功能】·一年前","【国际服变态「有不拉回加速」】·一年前","【[七欢日]利刃9.16】·一年前","【☢国际服多功能变态脚本】·一年前","【国际服防封[浪白]】·一年前","【AD国际服功能】·一年前","【[七欢日]三侬v4修复版】·一年前","【林烨3.1全防全源】·一年前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A9()
run_lua(({"aa0b2a26","20db3aaa","7527038a","d30b9d11","722f6120","cb4d85cb","a937cb18","8cdbddf1","6641b1f1","93f5053c","2ca4c230","a0486f16","ce97f686","ef1e25c0","05b27580","2b2781a1","00f76d70","57d507ba","d9370c2b","a716bdd5","b46ea2be","exit"})[gg.choice({"【cfm小程序】·124天前","【硕】·一年前","【扶墙牛逼12】·一年前","【CFM锁头57自瞄脚本】·一年前","【嘉嘉越南服大合集(三十元订制)】·一年前","【全网游戏脚本库-脚本大师V1.2】·一年前","【CFM】·一年前","【苏烟T服〖源码〗lua】·一年前","【穿越火线小程序功能】·128天前","【cfm脚本最新。】·110天前","【cfm防封】·127天前","【新57自瞄】·126天前","【大韭菜CFM脚本】·128天前","【越南服改枪脚本1.3】·一年前","【cfm】·128天前","【单版透视】·一年前","【A三岁白CF越南鼓范围】·125天前","【cfm裸奔开火自瞄】·121天前","【超大无bug范围新57自瞄-[加密]】·121天前","【加密锁】·128天前","【cfm小程序功能脚本】·124天前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A10()
run_lua(({"aef3bcee","2f67ef3b","357e4f66","70bfd680","4e7bcacc","8b1a758e","c928ce54","bd1b48ae","9f2afba1","aa9c2f4e","0852c4ad","65ec8177","9d38ad41","97e9a120","99eba53d","e3578fc9","39c5cfdd","91df9c83","fd543ecb","7c988c80","2456b0c1","exit"})[gg.choice({"【正义枪战脚本(2)】·124天前","【白茶野蛮人大作战V4.0】·124天前","【黑月手游测试倍攻1】·124天前","【汤姆猫酷跑1.0】·124天前","【阿瓦贝尔仙境之花】·128天前","【幽游白书武术会】·128天前","【裸奔脚本】·一年前","【坦克无敌1】·128天前","【真三国无双·霸秒杀】·124天前","【王者荣耀吃鸡我的世界万能挂】·一年前","【科比2.2（奇异狩猎者）】·142天前","【聖姬】·128天前","【武侠乂透色】·124天前","【不败至的野蛮人】·124天前","【正义枪战超变态脚本】·半年前","【生死狙击大脚本】·128天前","【小竹生死上分脚本】·128天前","【元素地牢】·128天前","【影之刃3】·128天前","【末日幸存者】·128天前","【失落城堡】·128天前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A11()
run_lua(({"c6f5d219","aca45a6a","0241bd2b","4d9687ff","b15df05c","8c945306","5760ae53","c4916f9e","ac45d7ff","345e4b4a","988b75a3","1ae7b37a","a86d624d","80bd6032","24a04ce1","9f80474c","6d3ce201","exit"})[gg.choice({"【轻体美化包】·一年前","【轻体脚本】·一年前","【枪7巨作】·一年前","【『QC』最终修复版】·一年前","【倾城轻体美化更新v3.9】·一年前","【小张低配吃鸡脚本】·一年前","【轻体透色（更新）】·126天前","【轻体[半城]】·一年前","【『QC』开伞秒下】·一年前","【『QC』轻体联发科透色】·一年前","【念佰轻体】·一年前","【轻体玖月更新】·半年前","【『QC』持枪自瞄】·一年前","【缩神轻量6.2】·126天前","【包子国际服轻量级脚本】·128天前","【贺柒美化5.2】·半年前","【轻量版】·124天前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A12()
run_lua(({"55faf353","9cc33c27","9eac3745","0e187afa","0b824685","954a5c3a","d69f58a1","45fb0cb8","a324f022","66fe7475","exit"})[gg.choice({"【酷跑80版脚本】·一年前","【冷熙全模式减cd】·一年前","【酷跑80版本脚本】·一年前","【冷熙80酷跑】·一年前","【无限复活2添加恢复数据】·一年前","【瞬移】·一年前","【裸奔午后】·一年前","【未来制作、79命运远征脚本(密码2)】·一年前","【全模式改米】·124天前","【[源码]白鲨酷跑82版脚本】·126天前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A13()
run_lua(({"25316917","edad2fad","2d6858c8","8121e4b3","0e38a09d","7cc3b587","4af226c1","b0013978","7ae24339","46fb373d","e40d4bc0","f37593b1","206825f0","2a0a9c1a","ce92e4c9","e54b4b61","3a99f165","de443f82","82e30630","4a1759cd","32981509","exit"})[gg.choice({"【王者内防】·一年前","【王者上帝视角】·一年前","【风流情圣秒复活】·一年前","【属性修改1.2】·一年前","【移动回程】·一年前","【0.0.3王者单机小白自创脚本】·一年前","【斌哥王者脚本】·一年前","【0.0.5王者单机小白自创脚本】·一年前","【王者刷战令脚本】·一年前","【武则天内存防】·一年前","【黑仙多功能变态脚本】·一年前","【傲飞完善脚本觉醒技能】·一年前","【爱罗脚本3.3】·一年前","【王者脚本（第一次做王者脚本）-修正】·一年前","【王者s20自定义减CD】·一年前","【梦幻编写王者脚本第10代】·一年前","【绘制自瞄】·一年前","【月初透视百里自瞄】·一年前","【机灵鬼（小机灵）】·一年前","【单自瞄(龙套8】·一年前","【新版优化自瞄】·一年前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A14()
run_lua(({"652c8914","56ac7a83","577be428","7841b57c","f69d7e39","111dd730","8a9e717e","6b394ea2","b9626155","4db2dfb6","cc7d603f","9001a88a","79939b19","4691871c","d434a86b","a70ae554","b3c0b988","8222988b","4b7515d7","8cb344f2","b3b536c3","exit"})[gg.choice({"【长风解『易鹏』】·一年前","【香肠派对脚本稳定功能】·一年前","【最终.智仙卍香肠派对稳定巅峰功能】·一年前","【最终.智仙卍香肠派对稳定巅峰功能】·一年前","【疯阳小白3.6巅峰终极辅助】·一年前","【湖心制作香肠派对3.0】·一年前","【神仙派对终极脚本（已修复）】·一年前","【[兄弟修复.白泽]白泽自由香肠脚本】·一年前","【[解]dd5.7外贸版】·一年前","【梦白自用香肠派对】·一年前","【11.14香肠派对】·一年前","【风之子香肠脚本】·一年前","【黑仙香肠派对脚本10月1】·一年前","【〖9.6日更新脚本〗智仙稳定巅峰功能】·一年前","【时光稳定脚本1.2】·一年前","【黄昏香肠派对1.9（终章开源优化）】·一年前","【『San解』滑稽】·一年前","【湖心制作香肠派对1.0】·一年前","【〖9.5日更新脚本〗智仙稳定巅峰功能】·一年前","【〖9.4日更新脚本〗智仙稳定巅峰功能】·一年前","【香肠派对blasck_馒】·一年前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A15()
run_lua(({"a0723e11","508d87f8","a73dcf2d","b00bb78e","767895d4","f067ec9d","6c854134","exit"})[gg.choice({"【[源]幻影】·一年前","【（九月解）变态全局加速1】·一年前","【葬仙废品】·一年前","【变态全局加速(源)】·一年前","【换肤】·一年前","【时空召唤射手专用】·142天前","【时空】·125天前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A16()
run_lua(({"e1a6de48","989a7b0a","d1be9e7e","5daebaf6","94e5a4f7","370aa035","exit"})[gg.choice({"【明日之后变态脚本】·一年前","【明日之后稳定功能】·128天前","【『二爷科技全服优化版v44.0』】·一年前","【明日之后透视】·一年前","【明日之后最全脚本】·128天前","【[原创]叶秋明日之后实用脚本】·128天前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A17()
run_lua(({"0c191975","cf74a728","34c542be","ec93df82","83fd403f","ecdd6e22","1c741f30","15328432","9bcbbfed","14c63a0f","237ddd1d","7061cfdf","b44c70bc","41b3e157","41051728","0d44cdaf","f7d311fe","6b2ce822","2628ba57","6126e9f9","802e4f4c","exit"})[gg.choice({"【[脚本工具]验证大全写入工具(修复已知Bug)】·半年前","【自动找代码】·一年前","【通用加密工具】·一年前","【Lua解密工具】·一年前","【Enc解密】·一年前","【木酥拦截器_解密工具】·一年前","【卡密】·一年前","【啸天脚本2.0】·一年前","【通用解密工具】·一年前","【加密工具】·一年前","【脚本解密】·一年前","【[GG脚本库]在线运行_V1.3】·一年前","【[逸辰原创]lua实现摩斯密码加密】·一年前","【拦截器单板】·一年前","【超强拦截器】·一年前","【⚠️无人加密⚠️】·一年前","【防拦截】·一年前","【GR独家灵魂出窍（源码！）】·一年前","【鸟之风防小白加密2.0.TG】·一年前","【WKX7.0】·一年前","【酷跑天空之城加速】·一年前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A18()
run_lua(({"c757dede","d4f0eeb9","07bf2066","26fa1a10","07adc7c4","43043394","8e6e7210","92a5f70a","6dfc5346","2ba2de0e","d30029e8","a89789d5","ebbf0b74","c6f6a7e4","faf08d59","189ab756","309b7eca","exit"})[gg.choice({"【维他命球球加速器】·一年前","【球球大作战脚本】·125天前","【B球球实用脚本】·一年前","【球球无加密】·一年前","【钟品良脚本q934952368】·一年前","【维他命球球加速器】·一年前","【吐球(未删减版)】·一年前","【八戒球球大作战】·一年前","【球球大作战吐球(自用版)】·一年前","【by:诀泽】·一年前","【维他命球球加速器】·一年前","【球球大作战】·124天前","【球仙脚本】·128天前","【球球大作战脚本（Tears内部）】·125天前","【球球☞辅助☜】·161天前","【球球大作战密码1234】·125天前","【球球大作战脚本-[凡生]】·128天前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A19()
run_lua(({"fb001311","1500fd1d","aa1ccfd2","1a4e0e10","c9383f82","exit"})[gg.choice({"【白嫖版】·一年前","【全民枪战多功能】·124天前","【全民枪战穿墙】·124天前","【金铲铲娱乐】·124天前","【全民枪战Xa原地刀人-快速过人机1】·124天前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A20()
run_lua(({"0b4f7cf8","07a746f8","3b5f8360","b98fe332","9d0096a0","4016e95e","4495c33d","a5a4eb84","a42b3fe9","c6bfe6ed","ef05e0ad","f95e7edd","3e790fb5","exit"})[gg.choice({"【豪哥枪战遁地加速踏空升天自瞄锁身锁头秒杀飞刀范围跳高午后聚点透视穿山云工具改枪改货币最终版】·一年前","【北辰枪战英雄脚本】·一年前","【EM枪神辅助】·半年前","【斌哥枪战英雄自用】·一年前","【楠天初始化遁地】·一年前","【挑战秒杀】·22天前","【吸血鬼专用脚本】·142天前","【[QX]-七喜枪战】·127天前","【仙阁-诸神黄昏9.24】·128天前","【枪战英雄超变脚本－（6】·142天前","【枪战英雄】·127天前","【枪战英雄专属i】·142天前","【枪战英雄脚本合集】·126天前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A21()
run_lua(({"dca36bca","be0f5e16","41de561d","b05191db","80bdfd63","41ba4bd7","644725ab","480d7b9e","c9bf4a19","e926fb3b","92874aed","439733a0","ef991bd6","1e47b7d4","ecc60d48","67f1509d","087bc2fc","79706e87","47c647ca","2415c4a8","c909063e","exit"})[gg.choice({"【豆子脚本@残梦反编译】·一年前","【林子解(修复)】·一年前","【[MC]YIYUNFZ】·一年前","【变态脚本】·一年前","【神高科技3.0我的世界脚本】·一年前","【老马我的世界】·一年前","【我的世界多功能】·128天前","【冷漠二改(修复版本）】·一年前","【ToolMod】·一年前","【MagicDream辅助（坐标传送）】·一年前","【传送改蛋超级脚本】·一年前","【[1.23]混淆v0.4最强免费版By成龙.lu】·半年前","【五芒星Gg修改器网易我的世界】·125天前","【我的世界JOKER挂】·125天前","【[源]混淆v0.2By成龙】·半年前","【任意附魔】·128天前","【〔我的世界〕】·125天前","【网易我的世界脚本】·125天前","【我的世界8项多功能脚本】·128天前","【DGZASSISTFREE.Rl-Enc】·半年前","【叶少我的世界无敌外挂】·125天前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A22()
run_lua(({"4ac744a3","c332d35b","ee5fbc20","503d65e8","1e8ced9b","3597fc3b","b2801bac","65e01116","425f8f7e","5bf3bed6","8ef7a19a","e7d0b858","91b32472","4d40932c","88dd7844","43640f34","0cbc0e4c","1e3e3d28","a6427568","exit"})[gg.choice({"【QQ飞车稳如死狗(裸奔)】·一年前","【飞车稳定排位】·一年前","【小久飞车无限氮气1.2倍数】·126天前","【『倾城』飞车台服】·126天前","【QQ飞车稳定加速（单选ca内存）】·125天前","【QQ飞车改机甲的】·126天前","【小久飞车全防】·125天前","【QQ飞车】·126天前","【QQ飞车】·125天前","【QQ飞车脚本】·125天前","【飞车微加速1.12微调版】·125天前","【Ly团队沐凡飞车无限小喷】·125天前","【飞车脚本】·127天前","【飞车稳定奔放(配拦截就行)】·128天前","【飞车新版公能】·126天前","【小久轻飘加速双喷】·126天前","【[杰哥解]QQ飞车】·125天前","【自用加速免疫】·125天前","【台湾飞车】·128天前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A23()
run_lua(({"b9f3cbb5","1da6a258","42976da5","6369b057","fb2216f7","86ce6f04","f299290d","d0fa8f1c","51942427","exit"})[gg.choice({"【枪神对决国际服ndm】·一年前","【冰～】·142天前","【○枪神对决】·142天前","【[SSDECOMP]枪神全功能脚本3】·142天前","【枪神对决全套脚本】·142天前","【范围吸人】·142天前","【枪神对决全人物子弹追踪＋自瞄】·142天前","【枪神自用】·142天前","【某枪神对决脚本】·142天前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A24()
run_lua(({"6d64182d","18f327dd","893108f0","da5a14fc","exit"})[gg.choice({"【（搬运）荒野乱斗】·一年前","【荒野乱斗(解)】·一年前","【荒野乱斗最新】·124天前","【荒野乱斗】·142天前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A25()
run_lua(({"d4ba0281","1f8905ea","1468e0b5","00fe5331","3473c95e","2cf10def","a4bd13dc","4d4647c8","b0e4a564","bb632892","55089848","42650d49","d1bd0ef3","08084eb6","edfd65ae","exit"})[gg.choice({"【火影忍者0.9】·一年前","【火影忍者部分功能[解]】·一年前","【火影忍者全屏视野[非裸奔含防封]】·一年前","【火影改人物】·一年前","【火影】·一年前","【七夕限定】·一年前","【无CD奥义秒杀】·一年前","【酒街V🔥解老七火影】·一年前","【积分赛忍者大招无CD秒杀】·一年前","【新手忍者技能无CD奥义秒杀】·一年前","【火影忍者锁血秒杀】·一年前","【幻之试炼密卷无cd秒杀】·一年前","【火影忍者基址一血全屏】·124天前","【自定义无cd伤害】·128天前","【无限奥义】·128天前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A26()
run_lua(({"22441d07","b4d71c08","exit"})[gg.choice({"【战魂铭人2.0】·一年前","【战魂铭人】·128天前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A27()
run_lua(({"c0c592b5","b826ba0e","a130df6a","c3f00a5d","9bcffab7","4a1f4f33","b537f870","c1e9ae7a","e3cdcbe3","19cb1cbd","d0e660b2","9255510d","76082e11","exit"})[gg.choice({"【原神免费全源1】·一年前","【摆渡完美7.0】·一年前","【绛丶原神】·一年前","【原神3.1】·一年前","【澪《原神》1.0】·110天前","【原神8】·一年前","【自己整合】·一年前","【原神脚本修复版】·一年前","【原神分享者】·一年前","【原神1】·一年前","【原神无限大招升级版】·一年前","【原神10】·128天前","【原神外部11】·128天前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A28()
run_lua(({"b044e318","c88f9203","efd292fc","2b71bf13","exit"})[gg.choice({"【妄想山海脚本1.49版本】·一年前","【妄想山海】·126天前","【妄想山海撒比】·126天前","【新山海1-[凡生]】·128天前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A29()
run_lua(({"730e5317","f6ef0f21","06323974","f4df3e01","d5f88d62","bb8fefdd","6f4a15f0","07d65dac","exit"})[gg.choice({"【倾城1.0元气骑士脚本『开源交流』】·一年前","【元气骑士5.0(解锁)】·一年前","【元气骑士4.1(中配版)】·一年前","【元气骑士6.0无CD】·一年前","【垃圾星辰一体】·148天前","【无敌＋铲子】·半年前","【元气骑士脚本】·125天前","【元气骑士】·124天前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A30()
run_lua(({"4b14a408","d21d290d","7e2b6f88","1f1ce458","2a73ffa0","837d8fe6","6cebb9ff","dab26380","a1077fa6","970f351c","38942a07","exit"})[gg.choice({"【使命召唤全服通用】·一年前","【使命召唤无后】·一年前","【宇智波八使命召唤】·一年前","【使命召唤】·一年前","【使命召唤手游】·一年前","【CODM缝合】·一年前","【使命召唤缝合怪】·一年前","【辉腾使命S7】·128天前","【使命召唤】·128天前","【科技在召唤】·128天前","【辉腾使命飞天】·128天前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A31()
run_lua(({"f4c50971","5b98429c","d1fafade","exit"})[gg.choice({"【浪人猎魂觉醒】·一年前","【归零猎魂觉醒325】·一年前","【猎魂觉醒】·一年前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A32()
run_lua(({"f963b2b9","exit"})[gg.choice({"【我功夫牛逼】·一年前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A33()
run_lua(({"18bc7053","62319617","3bab8385","exit"})[gg.choice({"【LOL手游透视】·一年前","【xxz英雄联盟呀嘿】·128天前","【lol32位裸奔实体透】·126天前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A34()
run_lua(({"64757866","6756034f","d80ecd41","6c751d0b","exit"})[gg.choice({"【英雄枪战金版】·一年前","【全屏眩晕】·一年前","【狂沙英雄枪战脚本】·一年前","【英雄枪战《墨清》】·126天前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A35()
run_lua(({"86063be6","fa162e79","551b7f90","66a6395a","2349be5d","98077ee2","2786355b","df0be273","ff39c391","333caaed","0aaa76d2","f3a49f90","f8093c8c","25ee2155","b714197b","78efe0d7","exit"})[gg.choice({"【楼主二改】·一年前","【自创小小英雄功能齐全脚本，密码：111】·一年前","【视野和全屏攻击】·一年前","【LeMoN解】·一年前","【小小英雄最新脚本】·一年前","【「解」小小英雄内部版】·一年前","【全屏伤害第一代】·一年前","【白茶小小英雄6.0免费辅助】·半年前","【小小英雄楼主】·一年前","【星墨小小英雄V.0.6】·126天前","【壹仙脚本】·一年前","【王者荣耀脚本】·一年前","【小小英雄脚本】·一年前","【原创小小英雄多功能】·一年前","【小小英雄脚本】·125天前","【[杰哥解]星墨小小英雄V.0.6】·125天前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A36()
run_lua(({"7f4c8770","571f9dc7","27686e72","c28f8848","b3d7c480","1988a4b6","exit"})[gg.choice({"【我的勇者长期更新脚本1.2】·一年前","【勇者脚本v0.5_1】·一年前","【我的勇者脚本长期更新0.6_1】·一年前","【我的勇者脚本长期更新1.0】·一年前","【我的勇者脚本长期更新1.1】·一年前","【我的勇者脚本长期更新0.9】·一年前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A37()
run_lua(({"8ba3ac88","143f2793","c6b41edf","4dd827f8","53a44332","36a5a87b","84a34780","73abf212","51af8110","exit"})[gg.choice({"【杀机】·一年前","【XG1.1】·一年前","【2第五人格庸人辅助】·125天前","【循环加速.TG】·125天前","【第五人格脚本】·125天前","【第五人格4.29】·125天前","【第五觉醒牛仔秒蓄力】·124天前","【第五人格脚本(加速修复)】·125天前","【摆渡人第五人格多功能脚本】·128天前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A38()
run_lua(({"7d5ecb0a","389630d1","5c7bed30","9896d552","9428d9bb","13922792","922027ec","6d425878","b527c9c0","6250466e","730320fc","1bd73706","a979af5c","ffc83274","3e0a537c","91daae85","8c8b6095","19286b31","8d6f8269","403fb74b","c331b308","exit"})[gg.choice({"【KK防封最新脚本】·半年前","【熈稳定多功能辅助1.22V】·一年前","【[适配国服0.71]修复长安】·一年前","【琛_国服_0.6.7】·一年前","【东街猫新版】·一年前","【多功能手跑脚本】·一年前","【整合带人跑图】·一年前","【源码_琛_国服_v1_9_6_2020年10月6日】·一年前","【奈何10.29新更新】·一年前","【琛0.6.7二改含预言】·一年前","【沐桃国服瞬全图功能整合版】·一年前","【新0.6.6整合】·一年前","【整合MUQI（欢迎分享）(3)(3)】·一年前","【琛云脚本】·一年前","【整合脚本】·一年前","【0安妮光遇云辅助】·一年前","【国际服瞬移整合⚡0.10.5】·一年前","【五龙出征[一方](国服)】·一年前","【逮虾户】·一年前","【极速光人(瞎几把加功能版)】·一年前","【Skyscript】·46天前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A39()
run_lua(({"70d813c6","6a756e9b","0ce74715","bbbd104d","exit"})[gg.choice({"【猫和老鼠（Tears)】·一年前","【菠萝猫和老鼠实战脚本】·一年前","【猫和老鼠[杰哥解]】·125天前","【猫和老鼠】·126天前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A40()
run_lua(({"83e7bce8","exit"})[gg.choice({"【时空猎人无dc】·一年前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A41()
run_lua(({"0da0fd29","98e0cf9d","eff65b2e","exit"})[gg.choice({"【忍者必须死多功能脚本】·一年前","【忍着必须死1.2】·一年前","【忍者必须死1.0】·一年前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A42()
run_lua(({"d8231b32","d5af4ac6","exit"})[gg.choice({"【❤️小灰灰❤️决战平安京1.0】·一年前","【仙圣加速安卓国服0.6.5跑图（吸光翼方舟圣岛办公室已修复152）】·一年前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A43()
run_lua(({"4d9293c7","90414dad","e43acdad","aefcd227","481d4e0e","eccf5e31","9d94d757","018e2f2f","936ba14a","ad2e803b","3bfb6f2a","0cd2a32a","f06183ab","0fbb4bb4","f690e352","1fc2e8c9","34f32cc5","b3453b1c","9fcce25a","exit"})[gg.choice({"【快乐游戏修改】·一年前","【荒野行动七夕脚本】·一年前","【魂师荒野行动脚本】·一年前","【12.27荒野辅助！稳稳的】·一年前","【魂荒野行动（国服日服）】·一年前","【荒野行动】·142天前","【荒野行动脚本（国服日服）】·一年前","【荒野行动脚本节日娱乐】·一年前","【荒野日服脚本】·一年前","【国服最强最新荒野行动脚本】·142天前","【妓十七荒野行动雪藏版】·126天前","【魂师荒野行动脚本裸奔】·一年前","【觉醒之战】·一年前","【[反]荒野行动透视】·一年前","【K6自创脚本.给我儿子专属定制lua】·一年前","【国服荒野360版本透视.[19831483]】·126天前","【作者G周大大G荒野行动辅助】·半年前","【荒野行动】·124天前","【荒野行动透视】·一年前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A44()
run_lua(({"0db9a630","4f27060e","exit"})[gg.choice({"【消消乐GG脚本】·半年前","【开心消消乐脚本】·125天前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A45()
run_lua(({"82d19fc8","b0473202","exit"})[gg.choice({"【小灰灰弓箭手大作战离线脚本】·一年前","【弓箭（加密)密码123456】·124天前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A46()
run_lua(({"5567ed8d","a386fea9","aaa59a61","cf966d35","56dab9a4","exit"})[gg.choice({"【密码112233腾讯桌球辅助线修复版】·一年前","【台球帝国-】·124天前","【腾讯桌球延长线】·一年前","【腾讯桌球】·128天前","【台球桌球脚本(2)加密】·124天前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A47()
run_lua(({"e6b635b4","exit"})[gg.choice({"【灵魂撕裂1.0】·一年前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A48()
run_lua(({"5a37ec1c","0e5ac821","8f26d929","exit"})[gg.choice({"【太空杀3.0】·一年前","【太空杀4.0】·一年前","【BQ太空杀】·一年前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A49()
run_lua(({"dd25d11c","exit"})[gg.choice({"【超凡免费】·110天前","返回上级"}, nil, nil)])
XGCK = -1
end

function G_A50()
run_lua(({"f3c337a2","exit"})[gg.choice({"【专属自定义上帝视角】·一年前","返回上级"}, nil, nil)])
XGCK = -1
end



function curl(lua_url,post)
if S==nil then S={username="G"..math.random(100000,999999),uid=0} end
local rep=gg.makeRequest(lua_url,{["Cookie"]= "uid="..S["uid"]},post)
if not (rep.headers.setuid==nil) then
S.uid=rep.headers.setuid[1]
gg.saveVariable(S,file_setting)
end
return dec_str(rep.content)
end

function gg.playMusic()
print("脚本大师提示：当前修改器不支持播放音乐")
end



function run_lua(md5,mod)
if mod==nil then mod=0 end
if (md5==nil or md5=="exit") then 
return G_ui() 
end


local lua_alert=gg.makeRequest(url.."?toast="..md5).content
if (lua_alert==nil or lua_alert=="") then lua_alert="获取文件在线说明失败" end
local but3="[添加收藏]"
if mod==2 then but3="[×取消收藏×]" end
local alert=gg.alert(lua_alert,"[进入脚本]","[查看源代码]",but3)
if alert==0 then return debug.getinfo(3)["func"]() end
local lua_name=lua_alert:sub(1,lua_alert:find(":")-1)
if alert == 1 then
local cmd=curl(url.."?file="..md5)
local run,err=pcall(load(cmd)) 
if not(err==nil or err:find("field 'exit'")) then run_err="似乎出现了以下错误(开发中)：\n"..err.."\n\n" else run_err="" end
local pl=gg.alert(lua_name..":\n<脚本结束了>\n\n"..run_err.." 这个脚本怎么样？\n","赞👍","踩👎","添加评论")
if pl==nil then return end
if ( pl== 1 or  pl==2) then
gg.toast(curl(url.."?toast="..md5.."&set="..pl),true)
end
if pl==3 then 
local km=gg.prompt({lua_alert.."\n\n请输入你的评论:"},{""},{"text"})
if km==nil then
return run_lua(md5)
end
if (km[1] == "" or km[1]==nil) then 
gg.toast("备注不能为空",true)
else
gg.toast(curl(url.."?toast="..md5.."&txt="..km[1]),true)
end
end
XGCK = -1
return
end

if alert == 2 then
local cmd=curl(url.."?file="..md5,"look")
if(cmd:byte(1)==27) then gg.alert("⚠注意:此脚本已编译⚠","") end
local alert_a=gg.alert("--源代码--\n"..cmd:sub(1,50400),"赞👍","踩👎","保存到本地")
if (alert_a== 1 or alert_a==2) then
gg.alert(curl(url.."?toast="..md5.."&set="..alert_a))
end
if alert_a == 3 then
if S.uid==0 then 
gg.alert("请先登录，首页>个人中心")
return run_lua(md5)
end
local lua_file="/storage/emulated/0/Download/"..lua_name..".lua"
io.open(lua_file, "w"):write(cmd):close()
gg.alert("脚本已保存至："..lua_file)
return gg.setVisible(false)
end
return run_lua(md5)
end

if alert == 3 then 
gg.alert(curl(url.."?lua=userconf","mod="..mod.."&favorites="..md5)) 
end
end

while true do
  if gg.isVisible(true) then
XGCK = 1
gg.setVisible(false)
  end
  gg.clearResults()
  if XGCK == 1 then
G_main()
  end
end
